
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>别说你不知道以太坊 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../btc/">
            
                <a href="../btc/">
            
                    
                    比特币篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../btc/btc-1.html">
            
                <a href="../btc/btc-1.html">
            
                    
                    你好，比特币
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../btc/btc-2.html">
            
                <a href="../btc/btc-2.html">
            
                    
                    越努力，越幸运 —— 比特币挖矿奥义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../btc/btc-3.html">
            
                <a href="../btc/btc-3.html">
            
                    
                    上帝给我十个比特币去交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../btc/btc-4.html">
            
                <a href="../btc/btc-4.html">
            
                    
                    比特币分叉——是技术的纠纷还是利益的冲突？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../btc/btc-5.html">
            
                <a href="../btc/btc-5.html">
            
                    
                    时代的召唤 —— 区块链 1.0 VS 2.0
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    以太坊篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="eth-1.html">
            
                <a href="eth-1.html">
            
                    
                    别说你不知道以太坊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >别说你不知道以太坊</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><img src="http://blockchain8.tech/usr/uploads/2018/04/3101884876.jpg" alt="97BB4625FC0F77D101B26D42954C2874.jpg"></p>
<h1 id="&#x4EE5;&#x592A;&#x574A;&#x6982;&#x8FF0;">&#x4EE5;&#x592A;&#x574A;&#x6982;&#x8FF0;</h1>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x4ECB;&#x7ECD;&#x4EE5;&#x592A;&#x574A;">&#x4E3A;&#x4EC0;&#x4E48;&#x4ECB;&#x7ECD;&#x4EE5;&#x592A;&#x574A;</h2>
<p>&#x5C3D;&#x7BA1;&#x5F88;&#x591A;&#x4EBA;&#x5BF9;&#x533A;&#x5757;&#x94FE;&#x4E0D;&#x751A;&#x4E86;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x5B9A;&#x542C;&#x8BF4;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x4F5C;&#x4E3A;&#x5F00;&#x5C71;&#x5288;&#x5730;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5143;&#x8001;&#xFF0C;&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x5F15;&#x8D77;&#x4E89;&#x8BAE;&#x3002;</p>
<p>&#x4EE5;&#x592A;&#x574A;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;
&#x4E3A;&#x4EC0;&#x4E48;&#x4EE5;&#x592A;&#x574A;&#x591F;&#x8D44;&#x683C;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x4ECB;&#x7ECD;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#xFF1F;
&#x200B;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4F5C;&#x8005;&#x7684;&#x559C;&#x597D;&#x800C;&#x5DF2; = =</p>
<p>&#x5F53;&#x7136;&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x5728;&#x4E4B;&#x524D;&#x6211;&#x6709;&#x63D0;&#x5230;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6280;&#x672F;&#x67B6;&#x6784;&#x5C5E;&#x4E8E;&#x533A;&#x5757;&#x94FE;1.0&#x6280;&#x672F;&#x67B6;&#x6784;&#xFF0C;&#x800C;&#x4EE5;&#x592A;&#x574A;&#x5C5E;&#x4E8E;&#x533A;&#x5757;&#x94FE;2.0&#x6280;&#x672F;&#x67B6;&#x6784;&#xFF0C;&#x4ECE;1.0&#x8D70;&#x5411;2.0&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4E0D;&#x540C;&#x662F;2.0&#x6280;&#x672F;&#x67B6;&#x6784;&#x62E5;&#x6709;&#x4E86;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x5C42;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x62E5;&#x6709;&#x4E86;&#x66F4;&#x52A0;&#x5B8C;&#x5907;&#x7684;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x6211;&#x7528;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6BD4;&#x55BB;&#x65B9;&#x4FBF;&#x7406;&#x89E3;&#xFF1A;</p>
<p>&#x533A;&#x5757;&#x94FE;1.0&#x6280;&#x672F;&#x67B6;&#x6784;&#x5C31;&#x50CF;&#x662F;<strong>&#x8BA1;&#x7B97;&#x5668;</strong>&#xFF0C;&#x57FA;&#x672C;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x7B49;&#x6570;&#x503C;&#x8BA1;&#x7B97;&#xFF0C;&#x6709;&#x4E9B;&#x9AD8;&#x7EA7;&#x8BA1;&#x7B97;&#x5668;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x5B9A;&#x7684;&#x5F00;&#x53D1;&#x529F;&#x80FD;&#xFF08;&#x5982;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#xFF09;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/2187210467.jpg" alt="euro-870757_1280.jpg"></p>
<p>&#x533A;&#x5757;&#x94FE;2.0&#x6280;&#x672F;&#x67B6;&#x6784;&#x5C31;&#x50CF;&#x662F;<strong>&#x8BA1;&#x7B97;&#x673A;</strong>&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x5F00;&#x53D1;&#x5404;&#x79CD;&#x8F6F;&#x4EF6;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x662F;&#x8BA1;&#x7B97;&#x5668;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x626B;&#x96F7;&#x6E38;&#x620F;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/2476749269.jpg" alt="office-583839_1280.jpg"></p>
<p>&#x4EE5;&#x592A;&#x574A;&#x5C31;&#x662F;&#x5F53;&#x524D;&#x533A;&#x5757;&#x94FE;2.0&#x6280;&#x672F;&#x67B6;&#x6784;&#x7684;&#x4EE3;&#x8868;&#x3002;&#x4E0B;&#x56FE;&#x4E3A;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x8D44;&#x672C;&#x5E02;&#x503C;&#x6392;&#x540D;&#xFF1A;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/675072174.png" alt="EA872AAA-11D6-4E19-B630-6D9E698E1923.png"></p>
<p>&#x4ECE;&#x6392;&#x540D;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8D44;&#x672C;&#x5E02;&#x573A;&#x5BF9;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x70ED;&#x8877;&#x7A0B;&#x5EA6;&#x3002;&#x4E00;&#x4E9B;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x533A;&#x5757;&#x94FE;2.0&#x7684;&#x4EE3;&#x8868;&#x4EE5;&#x592A;&#x574A;&#x8DB3;&#x4EE5;&#x53D6;&#x4EE3;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x8FC7;&#x4E8E;&#x6FC0;&#x8FDB;&#xFF0C;&#x53EF;&#x80FD;&#x6027;&#x5F88;&#x5C0F;&#x3002;</p>
<h2 id="&#x4EE5;&#x592A;&#x574A;&#x4E0E;&#x4EE5;&#x592A;&#x5E01;">&#x4EE5;&#x592A;&#x574A;&#x4E0E;&#x4EE5;&#x592A;&#x5E01;</h2>
<p>&#x901A;&#x5E38;&#xFF0C;<strong>&#x4EE5;&#x592A;&#x574A;&#xFF08;Ethereum&#xFF09;</strong>&#x8868;&#x793A;&#x7684;&#x662F;<strong>&#x6709;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x529F;&#x80FD;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5F00;&#x53D1;&#x5E73;&#x53F0;</strong>&#xFF0C;&#x800C;<strong>&#x4EE5;&#x592A;&#x5E01;&#xFF08;Ether&#xFF09;</strong>&#x6307;&#x7684;&#x662F;<strong>&#x4EE5;&#x592A;&#x574A;&#x4E0A;&#x7528;&#x4E8E;&#x4EA4;&#x6613;&#x7684;&#x8D27;&#x5E01;</strong>&#x3002;</p>
<p>&#x7C7B;&#x4F3C;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4EE5;&#x592A;&#x5E01;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x533A;&#x5757;&#x94FE;&#x8D27;&#x5E01;&#xFF0C;&#x53EA;&#x80FD;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x5E73;&#x53F0;&#x4E0A;&#x4F7F;&#x7528;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/1164759014.png" alt="7692CB35-4CB2-47AE-AB93-0DDE3476D36F.png"></p>
<p>&#x4E0A;&#x56FE;&#x662F;&#x4EE5;&#x592A;&#x574A;&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;&#x4E0B;&#x7684;&#x8D26;&#x6237;&#x4EE5;&#x592A;&#x5E01;&#x4F59;&#x989D;&#x622A;&#x56FE;&#xFF08;&#x5047;&#x88C5;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x62E5;&#x6709;35.218 ETH&#xFF09;&#x3002;</p>
<h2 id="&#x4EE5;&#x592A;&#x574A;&#x7B80;&#x53F2;">&#x4EE5;&#x592A;&#x574A;&#x7B80;&#x53F2;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53D1;&#x660E;&#x8005;&#x4E2D;&#x672C;&#x806A;&#x81F3;&#x4ECA;&#x4ECD;&#x662F;&#x4E2A;&#x8C1C;&#xFF0C;&#x7F51;&#x4E0A;&#x6D41;&#x4F20;&#x7684;&#x5404;&#x79CD;&#x5173;&#x4E8E;&#x4E2D;&#x672C;&#x806A;&#x672C;&#x4EBA;&#x7684;&#x7167;&#x7247;&#x4E0E;&#x65B0;&#x95FB;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x672A;&#x7ECF;&#x8FC7;&#x8BC1;&#x5B9E;&#x3002;&#x4F46;&#x662F;&#x4EE5;&#x592A;&#x574A;&#x4E0D;&#x540C;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x521B;&#x59CB;&#x4EBA;&#x201C;V&#x795E;&#x201D;&#x4ECE;&#x4EE5;&#x592A;&#x574A;&#x521B;&#x7ACB;&#x4E4B;&#x521D;&#x5230;&#x73B0;&#x5728;&#x90FD;&#x4E00;&#x76F4;&#x90FD;&#x51FA;&#x73B0;&#x5728;&#x516C;&#x4F17;&#x89C6;&#x91CE;&#x91CC;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/2466234790.jpg" alt="1280px-VitalikButerinProfile.jpg"></p>
<p>&#x5173;&#x4E8E;&#x201C;V&#x795E;&#x201D;Vitalik Buterin&#x7684;&#x5C65;&#x5386;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7B80;&#x5355;&#x83B7;&#x53D6;&#x5230;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x591A;&#x4F59;&#x8D58;&#x8FF0;&#xFF0C;&#x8FD9;&#x91CC;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x51E0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#xFF1A;</p>
<ul>
<li>2011&#x5E74;&#xFF0C;17&#x5C81;&#x7684;V&#x795E;&#x63A5;&#x89E6;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4ECE;&#x521A;&#x5F00;&#x59CB;&#x7684;&#x55E4;&#x4E4B;&#x4EE5;&#x9F3B;&#x5230;&#x4E00;&#x5FC3;&#x6295;&#x8EAB;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x4E2D;&#x3002;</li>
<li>2013&#x5E74;&#xFF0C;V&#x795E;&#x4ECE;&#x52A0;&#x62FF;&#x5927;&#x6ED1;&#x94C1;&#x5362;&#x5927;&#x5B66;&#x8F8D;&#x5B66;&#xFF0C;&#x5F00;&#x59CB;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x6E38;&#x5B66;&#x7ECF;&#x5386;&#xFF0C;&#x548C;&#x5168;&#x4E16;&#x754C;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7231;&#x597D;&#x8005;&#x4EA4;&#x6D41;&#x5B66;&#x4E60;&#x3002;</li>
<li>2013&#x5E74;&#x672B;&#xFF0C;&#x6E38;&#x5B66;&#x7ED3;&#x675F;&#x7684;V&#x795E;&#x64B0;&#x5199;&#x4E86;&#x4EE5;&#x592A;&#x574A;&#x767D;&#x76AE;&#x4E66;&#xFF0C;&#x83B7;&#x5F97;&#x5E7F;&#x6CDB;&#x8BA4;&#x53EF;&#x3002;</li>
<li>2014&#x5E74;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x8FDB;&#x884C;ICO&#xFF0C;&#x52DF;&#x96C6;&#x4E86;31000&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x52DF;&#x96C6;&#x4EF7;&#x683C;&#x4E3A;1&#x6BD4;&#x7279;&#x5E01;=2000&#x4EE5;&#x592A;&#x5E01;&#x3002;</li>
<li>2015&#x5E74;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x6B63;&#x5F0F;&#x4E0A;&#x7EBF;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x76F8;&#x6BD4;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x800C;&#x8A00;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x5E74;&#x8F7B;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x3002;&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x8BDE;&#x751F;&#x5230;&#x4EE5;&#x592A;&#x574A;&#x6B63;&#x5F0F;&#x4E0A;&#x7EBF;&#xFF0C;&#x8FD9;&#x4E2D;&#x95F4;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x4E5F;&#x66FE;&#x7206;&#x53D1;&#x5F0F;&#x589E;&#x957F;&#xFF0C;&#x5176;&#x4E2D;&#x8BB8;&#x591A;&#x865A;&#x62DF;&#x8D27;&#x5E01;&#x65E9;&#x5DF2;&#x65E0;&#x4EBA;&#x95EE;&#x6D25;&#x3002;&#x76F8;&#x6BD4;&#x8FD9;&#x4E9B;&#x865A;&#x62DF;&#x8D27;&#x5E01;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x6700;&#x5927;&#x7684;&#x7279;&#x70B9;&#x5C31;&#x662F;&#x62E5;&#x6709;<strong>&#x667A;&#x80FD;&#x5408;&#x7EA6;</strong>&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x7684;&#x6587;&#x7AE0;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#xFF0C;<strong>&#x667A;&#x80FD;&#x5408;&#x7EA6;</strong>&#x610F;&#x5473;&#x7740;&#x533A;&#x5757;&#x94FE;&#x5E73;&#x53F0;&#x62E5;&#x6709;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x7684;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x79CD;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#x76F8;&#x6BD4;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x672C;&#x8EAB;&#x7684;&#x4EA4;&#x6613;&#x811A;&#x672C;&#x800C;&#x8A00;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5F00;&#x53D1;&#x96BE;&#x5EA6;&#x548C;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#x4E0A;&#x90FD;&#x662F;&#x8D28;&#x7684;&#x98DE;&#x8DC3;&#x3002;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x7F16;&#x5199;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x5C31;&#x5982;&#x540C;&#x4F60;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x7AEF;App&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/3077308426.png" alt="D2C09D4C-7330-4E61-9052-5582BEEFA966.png"></p>
<h2 id="&#x4EE5;&#x592A;&#x574A;&#x4E0E;erc20&#x4EE3;&#x5E01;">&#x4EE5;&#x592A;&#x574A;&#x4E0E;ERC20&#x4EE3;&#x5E01;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x53D1;&#x884C;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x533A;&#x5757;&#x94FE;&#x865A;&#x62DF;&#x8D27;&#x5E01;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;</p>
<p>&#x5176;&#x5B9E;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x628A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6E90;&#x7801;&#x62FF;&#x8FC7;&#x6765;&#x6539;&#x4E2A;&#x540D;&#x5B57;&#x90E8;&#x7F72;&#x4E00;&#x4EFD;&#xFF0C;&#x7136;&#x800C;&#x5E76;&#x6CA1;&#x6709;&#x4EBA;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8D27;&#x5E01;&#x4EA4;&#x6613;&#xFF0C;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x4EBA;&#x4E3A;&#x4F60;&#x6316;&#x77FF;&#xFF0C;&#x6216;&#x8BB8;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7F51;&#x7EDC;&#x53EA;&#x6709;&#x4F60;&#x4E00;&#x4E2A;&#x77FF;&#x673A;&#x3002;</p>
<p>&#x5565;&#xFF1F;&#x4F60;&#x8BF4;&#x60F3;&#x7528;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#x65B9;&#x5F0F;&#x53D1;&#x884C;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x8D27;&#x5E01;&#xFF1F;</p>
<p>&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x521A;&#x624D;&#x6240;&#x8BF4;&#x7684;&#x65B9;&#x5F0F;&#x53D1;&#x884C;&#x865A;&#x62DF;&#x8D27;&#x5E01;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x201C;&#x521B;&#x9020;&#x201D;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7F51;&#x7EDC;&#x3002;&#x6211;&#x4EEC;&#x5439;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F16;&#x5199;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#xFF0C;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x4E4B;&#x4E0A;&#x53D1;&#x884C;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x7684;&#x4EE3;&#x5E01;&#x3002;</p>
<p>&#x4EE5;&#x592A;&#x574A;&#x7684;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x6709;ERC20(Ethereum token standard)&#x534F;&#x8BAE;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x7B26;&#x5408;ERC20&#x7684;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x6765;&#x53D1;&#x884C;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x5E01;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x5E01;&#x533A;&#x522B;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x7684;&#x539F;&#x751F;&#x5E01;&#xFF08;&#x4EE5;&#x592A;&#x574A;&#x4E0A;&#x7684;&#x539F;&#x751F;&#x5E01;&#x5C31;&#x662F;&#x4EE5;&#x592A;&#x5E01;&#xFF09;&#x3002;</p>
<p>ERC20&#x534F;&#x8BAE;&#x7684;&#x6807;&#x51C6;&#x63A5;&#x53E3;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-solidity">contract ERC20Interface {
function totalSupply() public constant returns (uint);
function balanceOf(address tokenOwner) public constant returns (uint balance);
function allowance(address tokenOwner, address spender) public constant returns (uint remaining);
function transfer(address to, uint tokens) public returns (bool success);
function approve(address spender, uint tokens) public returns (bool success);
function transferFrom(address from, address to, uint tokens) public returns (bool success);

event Transfer(address indexed from, address indexed to, uint tokens);
event Approval(address indexed tokenOwner, address indexed spender, uint tokens);
}
</code></pre>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x61C2;&#x7F16;&#x7A0B;&#xFF0C;&#x4E0A;&#x8FF0;&#x63A5;&#x53E3;&#x4E3B;&#x8981;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x8D27;&#x5E01;&#x8BE5;&#x6709;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#xFF1A;&#x67E5;&#x8BE2;&#x8D27;&#x5E01;&#x603B;&#x91CF;&#x3001;&#x67E5;&#x8BE2;&#x4F59;&#x989D;&#x3001;&#x8F6C;&#x8D26;&#x7B49;&#x3002;&#x901A;&#x8FC7;&#x5B9E;&#x73B0;&#x4E0A;&#x8FF0;&#x63A5;&#x53E3;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x5230;100&#x884C;&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5177;&#x5907;&#x57FA;&#x7840;&#x529F;&#x80FD;&#x7684;&#x4EE3;&#x5E01;&#x3002;</p>
<p>&#x73B0;&#x6709;&#x7684;&#x5F88;&#x591A;&#x865A;&#x62DF;&#x8D27;&#x5E01;&#x5176;&#x5B9E;&#x90FD;&#x662F;<a href="https://etherscan.io/tokens" target="_blank">&#x4EE5;&#x592A;&#x574A;&#x4E0A;&#x7684;ERC20&#x4EE3;&#x5E01;</a>&#xFF0C;&#x76EE;&#x524D;&#x4EE5;&#x592A;&#x574A;&#x4E0A;&#x603B;&#x5171;&#x6709;68229&#x79CD;ERC20&#x4EE3;&#x5E01;&#xFF0C;&#x5F53;&#x7136;&#x5176;&#x4E2D;&#x4E0D;&#x4E4F;&#x6709;&#x5F88;&#x591A;&#x9A97;&#x94B1;&#x7684;&#x7A7A;&#x6C14;&#x5E01;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/1436681647.jpg" alt="6BF40093626C63AEF678F006769BF21A.jpg"></p>
<p>&#x5176;&#x4E2D;&#x6392;&#x540D;&#x7B2C;&#x4E00;&#x7684;EOS&#xFF0C;&#x6211;&#x5C06;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x5927;&#x7BC7;&#x76EE;&#x91CC;&#x8BB2;&#x5230;&#x3002;&#x5F53;&#x4ECA;EOS&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x70ED;&#x95E8;&#xFF0C;&#x4E00;&#x4E9B;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x5F53;EOS&#x8131;&#x79BB;&#x4EE5;&#x592A;&#x574A;&#x56DE;&#x5F52;&#x81EA;&#x5DF1;&#x7684;&#x4E3B;&#x94FE;&#x540E;&#xFF0C;&#x5C06;&#x4F1A;&#x53D6;&#x4EE3;&#x4EE5;&#x592A;&#x574A;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x62ED;&#x76EE;&#x4EE5;&#x5F85;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 以太坊篇">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"别说你不知道以太坊","level":"1.3.1","depth":2,"previous":{"title":"以太坊篇","level":"1.3","depth":1,"path":"eth/README.md","ref":"eth/README.md","articles":[{"title":"别说你不知道以太坊","level":"1.3.1","depth":2,"path":"eth/eth-1.md","ref":"eth/eth-1.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"eth/eth-1.md","mtime":"2018-04-13T11:27:05.755Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-15T05:59:35.987Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

