
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>如果你也想在以太坊上写点什么 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="eth-2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../btc/">
            
                <a href="../btc/">
            
                    
                    比特币篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../btc/btc-1.html">
            
                <a href="../btc/btc-1.html">
            
                    
                    你好，比特币
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../btc/btc-2.html">
            
                <a href="../btc/btc-2.html">
            
                    
                    越努力，越幸运 —— 比特币挖矿奥义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../btc/btc-3.html">
            
                <a href="../btc/btc-3.html">
            
                    
                    上帝给我十个比特币去交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../btc/btc-4.html">
            
                <a href="../btc/btc-4.html">
            
                    
                    比特币分叉——是技术的纠纷还是利益的冲突？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../btc/btc-5.html">
            
                <a href="../btc/btc-5.html">
            
                    
                    时代的召唤 —— 区块链 1.0 VS 2.0
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    以太坊篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="eth-1.html">
            
                <a href="eth-1.html">
            
                    
                    别说你不知道以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="eth-2.html">
            
                <a href="eth-2.html">
            
                    
                    PoW和PoS不得不说的小秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.3" data-path="eth-3.html">
            
                <a href="eth-3.html">
            
                    
                    如果你也想在以太坊上写点什么
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >如果你也想在以太坊上写点什么</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><img src="http://blockchain8.tech/usr/uploads/2018/04/3710382379.jpeg" alt="&#x6B63;&#x4E49;&#xFF1F;"></p>
<h1 id="&#x533A;&#x5757;&#x94FE;&#x4E0E;&#x70ED;&#x70B9;&#x65B0;&#x95FB;">&#x533A;&#x5757;&#x94FE;&#x4E0E;&#x70ED;&#x70B9;&#x65B0;&#x95FB;</h1>
<p>&#x5982;&#x679C;&#x4F60;&#x5173;&#x6CE8;&#x524D;&#x51E0;&#x65E5;&#x7684;&#x70ED;&#x70B9;&#x65B0;&#x95FB;(&#x5F53;&#x524D;&#x65F6;&#x95F4;: 2018&#x5E74;04&#x6708;26&#x65E5;)&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x542C;&#x8BF4;&#x4EE5;&#x592A;&#x574A;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x843D;&#x5730;&#x5B9E;&#x8DF5;&#xFF0C;&#x8BB0;&#x5F55;&#x4E0D;&#x5141;&#x8BB8;&#x8BA8;&#x8BBA;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x533A;&#x5757;&#x94FE;&#x8FD9;&#x79CD;<strong>&#x533F;&#x540D;+&#x4E0D;&#x53EF;&#x7BE1;&#x6539;</strong>&#x7684;&#x7279;&#x6027;&#x7684;&#x786E;&#x4E5F;&#x975E;&#x5E38;&#x9002;&#x5408;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x8FD9;&#x6837;&#x7684;&#x7279;&#x6027;&#x4EC5;&#x4EC5;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x8D27;&#x5E01;&#x4EA4;&#x6613;&#x3002;&#x6BD4;&#x5982;&#x6BD4;&#x7279;&#x5E01;&#x5C3D;&#x7BA1;&#x62E5;&#x6709;&#x8BB0;&#x5F55;&#x6587;&#x5B57;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x6784;&#x60F3;&#x4E5F;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x4EA4;&#x6613;&#x672C;&#x8EAB;&#x7684;&#x5907;&#x6CE8;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x968F;&#x7740;&#x533A;&#x5757;&#x94FE;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x51FA;&#x73B0;&#x4E86;&#x3002;&#x4EBA;&#x4EEC;&#x6E10;&#x6E10;&#x4E5F;&#x60F3;&#x628A;&#x533A;&#x5757;&#x94FE;&#x5E94;&#x7528;&#x4E8E;&#x5404;&#x884C;&#x5404;&#x4E1A;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x8BB0;&#x5F55;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x4E0D;&#x4EC5;&#x4EC5;&#x8868;&#x793A;&#x67D0;&#x4E2A;&#x4EA4;&#x6613;&#x7684;&#x5907;&#x6CE8;&#xFF0C;&#x800C;&#x662F;&#x88AB;&#x8D4B;&#x4E88;&#x66F4;&#x5B9E;&#x9645;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x542B;&#x4E49;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x8FD9;&#x6B21;&#x7684;&#x70ED;&#x70B9;&#x65B0;&#x95FB;&#x91CC;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x5C31;&#x50CF;&#x662F;&#x4E2A;<strong>&#x533F;&#x540D;&#x8BBA;&#x575B;</strong>&#xFF0C;&#x8FD9;&#x4E2A;&#x8BBA;&#x575B;&#x4E0A;&#x8BB0;&#x5F55;&#x7684;&#x6587;&#x5B57;&#x65E0;&#x6CD5;&#x5F97;&#x77E5;&#x662F;&#x8C01;&#x8BB0;&#x5F55;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x88AB;&#x8F7B;&#x6613;&#x9500;&#x6BC1;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6280;&#x672F;&#x8BA9;&#x4E00;&#x4E9B;&#x80FD;&#x529B;&#x4E0D;&#x8DB3;&#x7684;&#x6076;&#x4EBA;&#x614C;&#x4E86;&#x795E;&#xFF0C;&#x5220;&#x5E16;&#x4E0D;&#x518D;&#x50CF;&#x5728;&#x77E5;&#x4E4E;&#x548C;&#x5FAE;&#x535A;&#x90A3;&#x6837;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x6BD5;&#x7ADF;&#x8FD9;&#x662F;&#x4E00;&#x7BC7;&#x6B63;&#x7ECF;&#x7684;&#x6280;&#x672F;&#x6587;&#x7AE0;&#xFF0C;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x804A;&#x804A;&#x4EE5;&#x592A;&#x574A;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x4FE1;&#x606F;&#x8BB0;&#x5F55;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x5F0F;&#x3002;</p>
<h1 id="&#x533A;&#x5757;&#x94FE;&#x4FE1;&#x606F;&#x8BB0;&#x5F55;">&#x533A;&#x5757;&#x94FE;&#x4FE1;&#x606F;&#x8BB0;&#x5F55;</h1>
<h2 id="&#x8BB0;&#x5F55;&#x5728;&#x4EA4;&#x6613;&#x91CC;">&#x8BB0;&#x5F55;&#x5728;&#x4EA4;&#x6613;&#x91CC;</h2>
<p>&#x672C;&#x6B21;&#x7684;&#x70ED;&#x70B9;&#x65B0;&#x95FB;&#x4E2D;&#xFF0C;&#x4FE1;&#x606F;&#x662F;&#x88AB;&#x8BB0;&#x5F55;&#x5728;&#x4E86;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/3206180216.png" alt="&#x503C;&#x5F97;&#x7EAA;&#x5FF5;&#x7684;&#x4EA4;&#x6613;"></p>
<p>&#x56FE;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EE5;&#x592A;&#x574A;&#x4EA4;&#x6613;&#x6240;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x540E;&#x4E00;&#x9879;<strong>&#x8F93;&#x5165;&#x4FE1;&#x606F;&#xFF08;Input Data&#xFF09;</strong>&#x5C31;&#x662F;&#x6BCF;&#x6B21;&#x4EA4;&#x6613;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5F53;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x88AB;&#x6253;&#x5305;&#x8FDB;&#x533A;&#x5757;&#x8FDB;&#x5165;&#x533A;&#x5757;&#x94FE;&#x540E;&#xFF0C;&#x4EA4;&#x6613;&#x91CC;&#x7684;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x81EA;&#x7136;&#x6C38;&#x4E45;&#x5B58;&#x50A8;&#x5728;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5177;&#x6709;&#x5386;&#x53F2;&#x7EAA;&#x5FF5;&#x610F;&#x4E49;&#x7684;&#x4EA4;&#x6613;&#x54C8;&#x5E0C;&#x503C;&#x662F;&#xFF1A;0x2d6a7b0f6adeff38423d4c62cd8b6ccb708ddad85da5d3d06756ad4d8a04a6a2&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x5E73;&#x53F0;&#x4E0A;&#x67E5;&#x8BE2;&#x5230;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x4F1A;&#x67E5;&#xFF0C;&#x90A3;&#x5C31;&#x70B9;&#x51FB;&#x8FD9;&#x4E2A;URL&#x5427;&#xFF1A;<a href="https://etherscan.io/tx/0x2d6a7b0f6adeff38423d4c62cd8b6ccb708ddad85da5d3d06756ad4d8a04a6a2" target="_blank">https://etherscan.io/tx/0x2d6a7b0f6adeff38423d4c62cd8b6ccb708ddad85da5d3d06756ad4d8a04a6a2</a> &#x3002;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x4EE5;Unicode-8&#x7F16;&#x7801;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x67E5;&#x770B;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x4E00;&#x4E0B;&#x4FE1;&#x606F;&#x4E0B;&#x65B9;&#x7684;<code>&lt;Convert to UT8&gt;</code>&#xFF0C;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#xFF1A;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/328385240.png" alt="&#x653F;&#x6CBB;&#x654F;&#x611F;&#x7684;&#x5185;&#x5BB9;"></p>
<p><del>&#x62C5;&#x5FC3;&#x88AB;&#x5220;&#x5E16;&#x6240;&#x4EE5;&#x8D34;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;</del></p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5F53;&#x4F60;&#x7528;&#x4E00;&#x4E9B;&#x4EE5;&#x592A;&#x574A;&#x94B1;&#x5305;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x7ED9;&#x4F60;&#x5199;&#x5165;&#x4FE1;&#x606F;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6BD5;&#x7ADF;&#x4FE1;&#x606F;&#x8FC7;&#x591A;&#x53EA;&#x4F1A;&#x589E;&#x52A0;&#x77FF;&#x673A;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x66F4;&#x591A;&#x7684;Gas&#x8D39;&#x3002;Gas&#x8D39;&#x4F60;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x624B;&#x7EED;&#x8D39;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4F60;&#x505A;&#x996D;&#x4F7F;&#x7528;&#x71C3;&#x6C14;&#x9700;&#x8981;&#x4EA4;&#x71C3;&#x6C14;&#x8D39;&#x4E00;&#x6837;&#xFF0C;&#x77FF;&#x5DE5;&#x4EEC;&#x4E3A;&#x4F60;&#x5DE5;&#x4F5C;&#x5B58;&#x50A8;&#x4FE1;&#x606F;&#x81EA;&#x7136;&#x4E5F;&#x8981;&#x83B7;&#x5F97;&#x76F8;&#x5E94;&#x7684;&#x62A5;&#x916C;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x4EA4;&#x6613;&#x7684;&#x53D1;&#x8D77;&#x4EBA;&#x548C;&#x63A5;&#x6536;&#x4EBA;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#xFF0C;&#x53D1;&#x9001;&#x91D1;&#x989D;&#x662F;0&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5728;&#x533A;&#x5757;&#x94FE;&#x5199;&#x5165;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x505A;&#xFF1A;&#x81EA;&#x5DF1;&#x53D1;&#x9001;&#x7ED9;&#x81EA;&#x5DF1;0&#x4E2A;&#x4EE5;&#x592A;&#x5E01;&#x3002;&#x8FD9;&#x6837;&#x53EA;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x5C11;&#x91CF;Gas&#x8D39;&#x5373;&#x53EF;&#x5199;&#x5165;&#x4FE1;&#x606F;&#x5230;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x592A;&#x5177;&#x5907;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x8FD1;&#x4E5F;&#x51FA;&#x73B0;&#x5F88;&#x591A;&#x63D0;&#x4F9B;&#x8FD9;&#x79CD;&#x670D;&#x52A1;&#x7684;&#x5C0F;&#x5DE5;&#x5177;&#x3002;&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5C0F;&#x5DE5;&#x5177;&#x7684;&#x65F6;&#x5019;&#x5343;&#x4E07;&#x8981;&#x8C28;&#x614E;&#xFF0C;&#x6211;&#x67E5;&#x9605;&#x4E86;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x4ED6;&#x4EEC;&#x53D1;&#x8D77;&#x7684;&#x4EA4;&#x6613;&#x662F;&#x4F60;&#x5411;&#x4ED6;&#x4EEC;&#x652F;&#x4ED8;xx&#x91D1;&#x989D;&#x7684;&#x4EE5;&#x592A;&#x5E01;&#x3002;&#x8FD9;&#x91CC;&#x63A8;&#x8350;&#x4E00;&#x4F4D;&#x5927;&#x4F6C;&#x524D;&#x8F88;&#x5F00;&#x53D1;&#x7684;&#x5C0F;&#x5DE5;&#x5177;&#xFF1A;<a href="http://dapdap.io/#/onChain" target="_blank">http://dapdap.io/#/onChain</a> &#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x65E0;&#x9700;&#x4F7F;&#x7528;&#x8D26;&#x6237;&#x5C31;&#x80FD;&#x591F;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x5199;&#x5165;&#x4FE1;&#x606F;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/999302397.png" alt="Ropsten&#x94FE;&#x4E0A;&#x7684;&#x4EA4;&#x6613;"></p>
<p>&#x6BD5;&#x7ADF;&#x6BCF;&#x6B21;&#x5199;&#x5165;&#x4FE1;&#x606F;&#x662F;&#x9700;&#x8981;&#x652F;&#x4ED8;Gas&#x8D39;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x662F;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x516C;&#x5F00;&#x7684;&#x6D4B;&#x8BD5;&#x94FE;<code>ropsten</code>&#x94FE;&#x4E0A;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6109;&#x5FEB;&#x5730;&#x628A;&#x524D;&#x8F88;&#x8D26;&#x6237;&#x4E0A;&#x7684;&#x94B1;&#x82B1;&#x5149;&#x5427;&#xFF01;</p>
<h2 id="&#x8BB0;&#x5F55;&#x5728;&#x5408;&#x7EA6;&#x91CC;">&#x8BB0;&#x5F55;&#x5728;&#x5408;&#x7EA6;&#x91CC;</h2>
<p>&#x4EE5;&#x592A;&#x574A;&#x7684;&#x8D26;&#x6237;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#xFF1A;<strong>&#x666E;&#x901A;&#x8D26;&#x6237;</strong>&#x548C;<strong>&#x5408;&#x7EA6;&#x8D26;&#x6237;</strong>&#x3002;<strong>&#x666E;&#x901A;&#x8D26;&#x6237;</strong>&#x5C31;&#x662F;&#x4E0A;&#x8FF0;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x8D26;&#x6237;&#xFF0C;&#x8DDF;&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x6237;&#x7684;&#x6027;&#x8D28;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;<strong>&#x5408;&#x7EA6;&#x8D26;&#x6237;</strong>&#x5B58;&#x50A8;&#x7684;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8D26;&#x6237;&#x548C;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#x53D1;&#x8D77;&#x4EA4;&#x6613;&#xFF0C;&#x8FDB;&#x800C;&#x8C03;&#x7528;&#x5176;&#x67D0;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x524D;&#x9762;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x7684;ERC20&#x4EE3;&#x5E01;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#x53D1;&#x884C;&#x7684;&#x3002;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#x672C;&#x8EAB;&#x53EF;&#x4EE5;&#x516C;&#x5F00;&#x4EE3;&#x7801;&#xFF08;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x516C;&#x5F00;&#xFF09;&#xFF0C;&#x5BF9;&#x4E8E;&#x516C;&#x5F00;&#x7684;&#x4EE3;&#x7801;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x5BA1;&#x67E5;&#x5176;&#x5408;&#x7EA6;&#x662F;&#x5426;&#x771F;&#x5B9E;&#xFF0C;&#x800C;&#x975E;&#x6B3A;&#x8BC8;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5C31;&#x662F;EOS&#x7684;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#xFF1A;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/3442610637.png" alt="EOS&#x5408;&#x7EA6;&#x8D26;&#x6237;"></p>
<p>&#x5408;&#x7EA6;&#x672C;&#x8EAB;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x63A5;&#x53E3;&#x53EF;&#x4EE5;&#x88AB;&#x6307;&#x5B9A;&#x4E3A;<strong>&#x53EA;&#x8BFB;&#x7684;</strong>&#xFF0C;&#x8FD9;&#x4E9B;&#x63A5;&#x53E3;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x5408;&#x7EA6;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4EC5;&#x8BFB;&#x53D6;&#x5408;&#x7EA6;&#x672C;&#x8EAB;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x597D;&#x5904;&#x662F;&#x8C03;&#x7528;&#x8FD9;&#x4E9B;&#x63A5;&#x53E3;&#x65E0;&#x9700;&#x5BF9;&#x5408;&#x7EA6;&#x8D26;&#x6237;&#x53D1;&#x8D77;&#x4EA4;&#x6613;&#xFF0C;&#x56E0;&#x6B64;&#x65E0;&#x9700;&#x652F;&#x4ED8;Gas&#x8D39;&#x5C31;&#x80FD;&#x67E5;&#x8BE2;&#x3002;</p>
<p>&#x5229;&#x7528;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x8F7B;&#x677E;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;<strong>&#x533F;&#x540D;&#x8BBA;&#x575B;&#x5408;&#x7EA6;</strong>&#x3002;&#x5728;&#x5B58;&#x50A8;&#x4FE1;&#x606F;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x652F;&#x4ED8;&#x5C11;&#x91CF;Gas&#x8D39;&#xFF0C;&#x5728;&#x8BFB;&#x53D6;&#x4FE1;&#x606F;&#x7684;&#x65F6;&#x5019;&#x662F;&#x514D;&#x8D39;&#x7684;&#x3002;&#x76F8;&#x6BD4;&#x4E8E;&#x628A;&#x4FE1;&#x606F;&#x5B58;&#x50A8;&#x5728;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x7684;&#x529F;&#x80FD;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="eth-2.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: PoW和PoS不得不说的小秘密">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"如果你也想在以太坊上写点什么","level":"1.3.3","depth":2,"previous":{"title":"PoW和PoS不得不说的小秘密","level":"1.3.2","depth":2,"path":"eth/eth-2.md","ref":"eth/eth-2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"eth/eth-3.md","mtime":"2018-04-26T12:57:12.941Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-26T12:57:46.296Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

