
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>比特币分叉——是技术的纠纷还是利益的冲突？ · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="btc-5.html" />
    
    
    <link rel="prev" href="btc-3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    比特币篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="btc-1.html">
            
                <a href="btc-1.html">
            
                    
                    你好，比特币
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="btc-2.html">
            
                <a href="btc-2.html">
            
                    
                    越努力，越幸运 —— 比特币挖矿奥义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="btc-3.html">
            
                <a href="btc-3.html">
            
                    
                    上帝给我十个比特币去交易
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="btc-4.html">
            
                <a href="btc-4.html">
            
                    
                    比特币分叉——是技术的纠纷还是利益的冲突？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="btc-5.html">
            
                <a href="btc-5.html">
            
                    
                    时代的召唤 —— 区块链 1.0 VS 2.0
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../eth/">
            
                <a href="../eth/">
            
                    
                    以太坊篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../eth/eth-1.html">
            
                <a href="../eth/eth-1.html">
            
                    
                    别说你不知道以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../eth/eth-2.html">
            
                <a href="../eth/eth-2.html">
            
                    
                    PoW和PoS不得不说的小秘密
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >比特币分叉——是技术的纠纷还是利益的冲突？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><img src="http://blockchain8.tech/usr/uploads/2018/03/1293805139.png" alt="Bitcoin-vs-BitcoinCash.png"></p>
<h1 id="&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6269;&#x5BB9;&#x95EE;&#x9898;">&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6269;&#x5BB9;&#x95EE;&#x9898;</h1>
<p>&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x4E00;&#x9879;&#x4F1F;&#x5927;&#x7684;&#x53D1;&#x660E;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x662F;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x53D1;&#x660E;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x4EFB;&#x4F55;&#x6280;&#x672F;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x8BDE;&#x751F;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5B58;&#x5728;&#x7684;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x5C31;&#x662F;<strong>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7;1M</strong>&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x8D77;&#x521D;&#x5E76;&#x6CA1;&#x6709;&#x9650;&#x5236;&#xFF0C;&#x540E;&#x6765;&#x968F;&#x7740;&#x53D1;&#x5C55;&#x4E2D;&#x672C;&#x806A;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x7C89;&#x5C18;&#x653B;&#x51FB;&#xFF08;&#x5927;&#x91CF;&#x4F4E;&#x989D;&#x4EA4;&#x6613;&#xFF09;&#x800C;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x653B;&#x51FB;&#x4F1A;&#x5BFC;&#x81F4;&#x533A;&#x5757;&#x5DE8;&#x5927;&#xFF0C;&#x4E8E;&#x662F;&#x4E2D;&#x672C;&#x806A;&#x5C06;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x5728;&#x4E86;1MB&#x5185;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x9650;&#x5236;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x751F;&#x6210;&#x65F6;&#x95F4;&#x7EA6;&#x4E3A;&#x5341;&#x5206;&#x949F;&#xFF0C;&#x800C;&#x6BCF;&#x4E2A;&#x6700;&#x57FA;&#x672C;&#x4EA4;&#x6613;&#x7684;&#x5927;&#x5C0F;&#x4E3A;250B&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x5341;&#x5206;&#x949F;&#x53EF;&#x4EA7;&#x751F;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7EA6;&#x4E3A;1024*1024/250 = 4194&#x6B21;&#x3002;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x5982;&#x679C;&#x67D0;&#x5341;&#x5206;&#x949F;&#x4EA7;&#x751F;&#x7684;&#x4EA4;&#x6613;&#x591A;&#x4E8E;4194&#x6B21;&#xFF0C;&#x591A;&#x51FA;&#x6765;&#x7684;&#x4EA4;&#x6613;&#x53EA;&#x80FD;&#x7B49;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x518D;&#x8FDB;&#x884C;&#x7ED3;&#x7B97;&#xFF0C;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#x4EA4;&#x6613;&#x7684;&#x963B;&#x585E;&#xFF0C;&#x53EA;&#x6709;&#x624B;&#x7EED;&#x8D39;&#x9AD8;&#x7684;&#x4EA4;&#x6613;&#x80FD;&#x591F;&#x88AB;&#x7ED3;&#x7B97;&#x3002;</p>
<p>&#x5728;&#x5386;&#x53F2;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x9650;&#x5236;&#x4E5F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x9650;&#x5236;&#x4FDD;&#x8BC1;&#x4E86;&#x6BCF;&#x5E74;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x7684;&#x589E;&#x957F;&#x5927;&#x5C0F;&#x5728;50G&#x4EE5;&#x5185;&#x3002;&#x540C;&#x65F6;&#x6839;&#x636E;&#x7535;&#x5B50;&#x7684;<strong>&#x6469;&#x5C14;&#x5B9A;&#x5F8B;</strong>&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x589E;&#x957F;&#x91CF;&#x4FDD;&#x8BC1;&#x4E86;&#x4E2A;&#x4EBA;&#x8282;&#x70B9;&#x90FD;&#x80FD;&#x5B58;&#x50A8;&#x5B8C;&#x6574;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4FE1;&#x606F;&#x3002;</p>
<blockquote>
<p>&#x6469;&#x5C14;&#x5B9A;&#x5F8B;&#x662F;&#x7531;&#x82F1;&#x7279;&#x5C14;&#x521B;&#x59CB;&#x4EBA;&#x4E4B;&#x4E00;&#x6208;&#x767B;&#xB7;&#x6469;&#x5C14;&#xFF08;Gordon Moore&#xFF09;&#x63D0;&#x51FA;&#x6765;&#x7684;&#x3002;&#x5176;&#x5185;&#x5BB9;&#x4E3A;&#xFF1A;&#x5F53;&#x4EF7;&#x683C;&#x4E0D;&#x53D8;&#x65F6;&#xFF0C;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x4E0A;&#x53EF;&#x5BB9;&#x7EB3;&#x7684;&#x5143;&#x5668;&#x4EF6;&#x7684;&#x6570;&#x76EE;&#xFF0C;&#x7EA6;&#x6BCF;&#x9694;18-24&#x4E2A;&#x6708;&#x4FBF;&#x4F1A;&#x589E;&#x52A0;&#x4E00;&#x500D;&#xFF0C;&#x6027;&#x80FD;&#x4E5F;&#x5C06;&#x63D0;&#x5347;&#x4E00;&#x500D;&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x6BCF;&#x4E00;&#x7F8E;&#x5143;&#x6240;&#x80FD;&#x4E70;&#x5230;&#x7684;&#x7535;&#x8111;&#x6027;&#x80FD;&#xFF0C;&#x5C06;&#x6BCF;&#x9694;18-24&#x4E2A;&#x6708;&#x7FFB;&#x4E00;&#x500D;&#x4EE5;&#x4E0A;&#x3002;</p>
</blockquote>
<p>&#x4F46;&#x662F;&#x968F;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6D41;&#x884C;&#x7A0B;&#x5EA6;&#x53D8;&#x9AD8;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53D8;&#x5F97;&#x65E5;&#x76CA;&#x663E;&#x8457;&#xFF0C;&#x5DF2;&#x7ECF;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x5FC5;&#x987B;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E8E;&#x662F;&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5FC5;&#x987B;&#x5206;&#x53C9;&#x3002;</p>
<h1 id="&#x6BD4;&#x7279;&#x5E01;&#x5206;&#x53C9;">&#x6BD4;&#x7279;&#x5E01;&#x5206;&#x53C9;</h1>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x5206;&#x53C9;">&#x4EC0;&#x4E48;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x5206;&#x53C9;</h2>
<p>&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x533A;&#x5757;&#x7684;&#x751F;&#x6210;&#x5E76;&#x975E;&#x50CF;&#x4E32;&#x7CD6;&#x846B;&#x82A6;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;&#x5C3D;&#x7BA1;&#x6316;&#x77FF;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x662F;&#x5FC5;&#x7136;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x77FF;&#x673A;&#x540C;&#x65F6;&#x6316;&#x5230;&#x77FF;&#xFF08;&#x4EA7;&#x751F;&#x4E86;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x7684;&#x533A;&#x5757;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x533A;&#x5757;&#x90FD;&#x7B26;&#x5408;&#x6821;&#x9A8C;&#x6761;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x4ED6;&#x77FF;&#x673A;&#x8282;&#x70B9;&#x5728;&#x6536;&#x5230;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4E0D;&#x4F1A;&#x62D2;&#x7EDD;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x505A;&#x8FD9;&#x6837;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;<strong>&#x4FDD;&#x5B58;&#x591A;&#x6761;&#x94FE;&#xFF0C;&#x4F46;&#x662F;&#x59CB;&#x7EC8;&#x5728;&#x6700;&#x957F;&#x94FE;&#x4E0A;&#x6316;&#x77FF;</strong>&#x3002;</p>
<p>&#x5982;&#x4F55;&#x7406;&#x89E3;&#x8FD9;&#x53E5;&#x8BDD;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x7EC4;&#x6F2B;&#x753B;&#x6765;&#x89E3;&#x91CA;&#xFF08;&#x53CB;&#x60C5;&#x611F;&#x8C22;&#x9876;&#x5C16;&#x63D2;&#x753B;&#x5E08; @Antler&#xFF09;&#x3002;&#x9996;&#x5148;&#x5047;&#x8BBE;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x540C;&#x6837;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x6316;347&#x53F7;&#x533A;&#x5757;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/517452621.jpg" alt="fork-1.jpg"></p>
<p>&#x4F60;&#x5728;&#x6316;347&#x53F7;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x6536;&#x5230;&#x4E86;&#x522B;&#x4EBA;&#x5728;&#x6B64;&#x94FE;&#xFF08;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E3A;A&#x94FE;&#xFF09;&#x5DF2;&#x6316;&#x5230;347&#x53F7;&#x533A;&#x5757;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/420768234.jpg" alt="fork-2.jpg"></p>
<p>&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x9A6C;&#x4E0A;&#x653E;&#x5F03;347&#x53F7;&#xFF0C;&#x6295;&#x8EAB;&#x5230;&#x6316;348&#x53F7;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x3002;&#xFF08;&#x8868;&#x9762;&#x7B11;&#x563B;&#x563B;&#xFF0C;&#x5185;&#x5FC3;mmp)</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/1717005367.jpg" alt="fork-3.jpg"></p>
<p>&#x63A5;&#x7740;&#xFF0C;&#x4F60;&#x53C8;&#x6536;&#x5230;&#x4E86;B&#x94FE;&#x4E0A;&#x7684;&#x6D88;&#x606F;&#x2014;&#x2014;&#x6709;&#x4E2A;&#x4EBA;&#x6316;&#x5230;&#x4E86;B&#x94FE;&#x4E0A;&#x7684;347&#x53F7;&#x533A;&#x5757;&#xFF01;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/1260109432.jpg" alt="fork-4.jpg"></p>
<p>&#x6B64;&#x65F6;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x672A;&#x6765;&#x7684;&#x6700;&#x957F;&#x94FE;&#x5230;&#x5E95;&#x662F;&#x54EA;&#x4E00;&#x6761;&#xFF0C;&#x552F;&#x4E00;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x5C31;&#x662F;&#x4FDD;&#x7559;B&#x94FE;&#x4E0A;&#x7684;347&#x533A;&#x5757;&#xFF08;&#x4E07;&#x4E00;B&#x94FE;&#x53D8;&#x6210;&#x6700;&#x957F;&#x94FE;&#x4E86;&#x9A6C;&#x4E0A;&#x8F6C;&#x79FB;&#x6218;&#x573A;&#xFF09;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/1221225405.jpg" alt="fork-5.jpg"></p>
<p>&#x5982;&#x679C;&#x975E;&#x5E38;&#x4E0D;&#x5E78;&#xFF0C;&#x4F60;&#x53C8;&#x6536;&#x5230;&#x4E86;B&#x94FE;&#x4E0A;348&#x533A;&#x5757;&#x5DF2;&#x88AB;&#x6316;&#x51FA;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/2338752224.jpg" alt="fork-6.jpg"></p>
<p>&#x90A3;&#x5C31;&#x653E;&#x5F03;A&#x94FE;&#x5427;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x843D;&#x540E;&#x4E8E;&#x65F6;&#x4EE3;&#x4E86;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/2244333152.jpg" alt="fork-7.jpg"></p>
<p>&#x5F00;&#x59CB;&#x52A0;&#x5165;B&#x94FE;&#xFF08;&#x76EE;&#x524D;&#x6700;&#x957F;&#x94FE;&#xFF09;&#x7684;&#x6316;&#x77FF;&#x5DE5;&#x4F5C;&#x4E2D;&#x3002;&#xFF08;&#x8001;&#x5927;&#x53EF;&#x80FD;&#x6C14;&#x5230;&#x5173;&#x95ED;&#x4E86;&#x77FF;&#x673A;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x6765;&#xFF09;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/3142499959.jpg" alt="fork-8.jpg"></p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5206;&#x53C9;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x533A;&#x5757;&#x94FE;&#x7684;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x6761;&#x94FE;&#x6210;&#x4E3A;&#x6700;&#x957F;&#x94FE;&#xFF0C;&#x8FD9;&#x6761;&#x4FBF;&#x662F;&#x5927;&#x591A;&#x6570;&#x77FF;&#x673A;&#x8BA4;&#x53EF;&#x7684;&#x94FE;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5B58;&#x5728;&#x4E24;&#x6761;&#x94FE;&#x540C;&#x65F6;&#x589E;&#x957F;&#x7684;&#x60C5;&#x51B5;&#x5462;&#xFF1F;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7B80;&#x5355;&#x7406;&#x89E3;&#xFF1A;&#x6316;&#x77FF;&#x96BE;&#x5EA6;&#x5F88;&#x5927;&#xFF0C;&#x591A;&#x4E2A;&#x77FF;&#x673A;&#x540C;&#x65F6;&#x6316;&#x5230;&#x77FF;&#x7684;&#x6982;&#x7387;&#x6781;&#x4F4E;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x4E0D;&#x65AD;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x624D;&#x4F1A;&#x51FA;&#x73B0;&#x4E24;&#x6761;&#x94FE;&#x540C;&#x65F6;&#x589E;&#x957F;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x8981;&#x65AD;&#x70B9;&#x5C31;&#x4F1A;&#x8BA9;&#x53E6;&#x4E00;&#x6761;&#x94FE;&#x957F;&#x5EA6;&#x53D8;&#x957F;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x540E;&#x4E5F;&#x4F1A;&#x9020;&#x6210;&#x5206;&#x53C9;&#xFF0C;&#x5206;&#x4E3A;<strong>&#x8F6F;&#x5206;&#x53C9;</strong>&#x548C;<strong>&#x786C;&#x5206;&#x53C9;</strong>&#x3002;&#x6211;&#x4EEC;&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x53EA;&#x8BA8;&#x8BBA;&#x786C;&#x5206;&#x53C9;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x786C;&#x5206;&#x53C9;">&#x4EC0;&#x4E48;&#x662F;&#x786C;&#x5206;&#x53C9;</h2>
<p>&#x786C;&#x5206;&#x53C9;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x5F3A;&#x786C;&#x7684;&#x5206;&#x53C9;&#xFF0C;&#x65B0;&#x7684;&#x534F;&#x8BAE;&#x4E0D;&#x518D;&#x517C;&#x5BB9;&#x65E7;&#x7684;&#x77FF;&#x673A;&#xFF0C;&#x77FF;&#x673A;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x5347;&#x7EA7;&#x534F;&#x8BAE;&#x624D;&#x80FD;&#x5728;&#x65B0;&#x7684;&#x94FE;&#x4E0A;&#x6316;&#x77FF;&#xFF0C;&#x5426;&#x5219;&#x65B0;&#x65E7;&#x77FF;&#x673A;&#x4F1A;&#x56E0;&#x4E3A;&#x534F;&#x8BAE;&#x51B2;&#x7A81;&#x5BFC;&#x81F4;&#x4ED6;&#x4EEC;&#x5BF9;&#x533A;&#x5757;&#x65E0;&#x6CD5;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#xFF0C;&#x8FDB;&#x800C;&#x5206;&#x9053;&#x626C;&#x9573;&#xFF0C;<strong>&#x5728;&#x4E24;&#x6761;&#x94FE;&#x4E0A;&#x5404;&#x81EA;&#x6316;&#x77FF;</strong>&#x3002;</p>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;-vs-&#x6BD4;&#x7279;&#x5E01;">&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1; vs &#x6BD4;&#x7279;&#x5E01;</h2>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x8FC7;&#x5206;&#x53C9;&#xFF0C;&#x8FD8;&#x4E0D;&#x6B62;&#x4E00;&#x6B21;&#x3002;&#x5386;&#x53F2;&#x4E0A;&#x6700;&#x8F70;&#x8F70;&#x70C8;&#x70C8;&#x7684;&#x786C;&#x5206;&#x53C9;&#x662F;BCH&#xFF08;&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#xFF09;&#xFF0C;&#x5176;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x4E0A;&#x8BB0;&#x5F55;&#x4E86;&#x5206;&#x53C9;&#x70B9;&#xFF1A;</p>
<blockquote>
<p>&#x6240;&#x6709;&#x4E8E;&#x533A;&#x5757;&#x9AD8;&#x5EA6; 478558 &#x65F6;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x62E5;&#x6709;&#x8005;&#xFF0C;&#x4E5F;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#x7684;&#x62E5;&#x6709;&#x8005;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x533A;&#x5757;478558&#x524D;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#x5171;&#x7528;&#x76F8;&#x540C;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x65B0;&#x7684;&#x534F;&#x8BAE;&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#x63A5;&#x53D7;&#x4E86;&#x6240;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x62E5;&#x6709;&#x8005;&#x7684;&#x8D22;&#x5BCC;&#xFF0C;&#x9075;&#x7167;&#x539F;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x6309;&#x7167;1&#xFF1A;1&#x5151;&#x6362;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x90A3;&#x4E2A;&#x533A;&#x5757;&#x524D;&#x62E5;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EBA;&#x5C06;&#x514D;&#x8D39;&#x83B7;&#x5F97;&#x4E00;&#x4EFD;&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#x5BA3;&#x4F20;&#x81EA;&#x5DF1;&#x62E5;&#x6709;&#x65B0;&#x529F;&#x80FD;&#xFF1A;</p>
<blockquote>
<p>&#x94FE;&#x4E0A;&#x6269;&#x5BB9; - &#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#x9075;&#x5FAA;&#x4E2D;&#x672C;&#x806A;&#x901A;&#x8FC7;&#x94FE;&#x4E0A;&#x6269;&#x5BB9;&#x5B9E;&#x73B0;&#x5168;&#x7403;&#x666E;&#x53CA;&#x7684;&#x8DEF;&#x7EBF;&#x56FE;&#x3002;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x5DF2;&#x88AB;&#x8BBE;&#x4E3A;&#x53EF;&#x8C03;&#x6574;&#xFF0C;&#x9ED8;&#x8BA4;&#x63D0;&#x5347;&#x5230;&#x4E86; 8MB &#x3002; &#x5141;&#x8BB8;&#x672A;&#x6765;&#x5927;&#x5E45;&#x63D0;&#x5347;&#x533A;&#x5757;&#x5BB9;&#x91CF;&#x7684;&#x7814;&#x7A76;&#x6B63;&#x5728;&#x8FDB;&#x884C; &#x3002;</p>
<p>&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x7B7E;&#x540D; - &#x65B0;&#x7684;&#x7B7E;&#x540D;&#x54C8;&#x5E0C; (SigHash) &#x7C7B;&#x578B;&#x63D0;&#x4F9B;&#x4E86;&#x91CD;&#x653E;&#x653B;&#x51FB;&#x4FDD;&#x62A4;&#x3001;&#x6539;&#x5584;&#x4E86;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4E5F;&#x89E3;&#x51B3;&#x4E86;&#x4E8C;&#x6B21;&#x54C8;&#x5E0C;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x65B0;&#x7684;&#x96BE;&#x5EA6;&#x8C03;&#x6574;&#x7B97;&#x6CD5;(DAA) - &#x54CD;&#x5E94;&#x5F0F;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;(PoW) &#x96BE;&#x5EA6;&#x8C03;&#x6574;&#x5141;&#x8BB8;&#x77FF;&#x5DE5;&#x6309;&#x5176;&#x610F;&#x613F;&#x4ECE;&#x65E7;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94FE;&#x8FC1;&#x79FB;&#x81F3;&#x65B0;&#x94FE;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x4FDD;&#x62A4;&#x6291;&#x5236;&#x7B97;&#x529B;&#x8FC7;&#x5EA6;&#x6CE2;&#x52A8;&#x3002;</p>
<p>&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5F00;&#x53D1; - &#x6709;&#x6570;&#x4E2A;&#x72EC;&#x7ACB;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x63D0;&#x4F9B;&#x7684;&#x8F6F;&#x4EF6;&#x5B9E;&#x73B0;&#xFF0C;&#x672A;&#x6765;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#x80FD;&#x591F;&#x62B5;&#x5FA1;&#x5728;&#x534F;&#x8BAE;&#x5F00;&#x53D1;&#x4E0A;&#x7684;&#x653F;&#x6CBB;&#x548C;&#x793E;&#x4EA4;&#x653B;&#x51FB;&#xFF0C;&#x6CA1;&#x6709;&#x5355;&#x72EC;&#x7684;&#x56E2;&#x961F;&#x6216;&#x9879;&#x76EE;&#x80FD;&#x63A7;&#x5236;&#x3002; bitcoin-ml &#x90AE;&#x4EF6;&#x5217;&#x8868;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x7528;&#x4E8E;&#x8DE8;&#x53D1;&#x5F00;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x4EE5;&#x5B9E;&#x73B0;&#x534F;&#x8BAE;&#x53D8;&#x66F4;&#x3002;</p>
</blockquote>
<p>&#x5148;&#x4E0D;&#x7528;&#x5728;&#x610F;&#x90A3;&#x4E9B;&#x4E13;&#x4E1A;&#x672F;&#x8BED;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x7B2C;&#x4E00;&#x6761;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;&#x5BF9;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x8FDB;&#x884C;&#x4E86;&#x6269;&#x5BB9;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x89E3;&#x51B3;&#x4E86;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x963B;&#x585E;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x6210;&#x529F;&#x964D;&#x4F4E;&#x4E86;&#x4EA4;&#x6613;&#x624B;&#x7EED;&#x8D39;&#x3002;</p>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x771F;&#x7684;&#x9700;&#x8981;&#x5206;&#x53C9;&#x5417;">&#x6BD4;&#x7279;&#x5E01;&#x771F;&#x7684;&#x9700;&#x8981;&#x5206;&#x53C9;&#x5417;</h2>
<p>&#x542C;&#x4E0A;&#x53BB;&#x7686;&#x5927;&#x6B22;&#x559C;&#x662F;&#x5417;&#xFF1F;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x4E9B;&#x90FD;&#x57FA;&#x4E8E;&#x524D;&#x6587;&#x90A3;&#x53E5;&#x8BDD;&#xFF1A;&#x201C;&#x4E8E;&#x662F;&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5FC5;&#x987B;&#x5206;&#x53C9;&#x201D;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x771F;&#x7684;&#x5FC5;&#x987B;&#x5206;&#x53C9;&#x5417;&#xFF1F;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x8BF4;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x771F;&#x7684;&#x5FC5;&#x987B;&#x786C;&#x5206;&#x53C9;&#x5417;&#xFF1F;&#x8D77;&#x7801;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#xFF08;Bitcoin Core&#xFF09;&#x4E0D;&#x8FD9;&#x4E48;&#x60F3;&#xFF0C;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x662F;&#x4E00;&#x7FA4;&#x6C34;&#x5E73;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E2D;&#x672C;&#x806A;&#x7684;&#x8FFD;&#x968F;&#x8005;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x80FD;&#x53D1;&#x751F;&#x786C;&#x5206;&#x53C9;&#xFF0C;&#x56E0;&#x4E3A;&#x533A;&#x5757;&#x7684;&#x6269;&#x5927;&#x65E0;&#x6CD5;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x89E3;&#x51B3;&#x4EA4;&#x6613;&#x963B;&#x585E;&#x95EE;&#x9898;&#xFF0C;&#x968F;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x7684;&#x589E;&#x591A;&#xFF0C;&#x628A;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x4ECE;1M&#x5230;2M&#x4ECD;&#x65E7;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x6269;&#x518D;&#x6269;&#xFF0C;&#x76F4;&#x5230;&#x666E;&#x901A;&#x4EBA;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x518D;&#x8FD0;&#x884C;&#x5176;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x53C8;&#x5C06;&#x88AB;&#x638C;&#x63E1;&#x5728;&#x4E2D;&#x5FC3;&#x5316;&#x7CFB;&#x7EDF;&#x7684;&#x624B;&#x91CC;&#xFF0C;&#x8FD9;&#x6837;&#x5B8C;&#x5168;&#x8FDD;&#x80CC;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x7684;&#x521D;&#x8877;&#x3002;</p>
<p>Core&#x56E2;&#x961F;&#x63D0;&#x51FA;&#x7684;&#x6539;&#x8FDB;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#x662F;<strong>&#x95EA;&#x7535;&#x7F51;&#x7EDC;</strong>&#xFF0C;&#x57FA;&#x672C;&#x7684;&#x601D;&#x60F3;&#x662F;&#x5C3D;&#x91CF;&#x4E0D;&#x4FEE;&#x6539;&#x6BD4;&#x7279;&#x5E01;&#x672C;&#x8EAB;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x5916;&#x90E8;&#x62D3;&#x5C55;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x53EA;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x53D1;&#x8D77;&#x5C11;&#x91CF;&#x7279;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x4F17;&#x591A;&#x4EA4;&#x6613;&#x5728;&#x7B2C;&#x4E8C;&#x5C42;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4E2D;&#x8FDB;&#x884C;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;<strong>&#x6BD4;&#x7279;&#x5E01;&#x73B0;&#x91D1;VS&#x95EA;&#x7535;&#x7F51;&#x7EDC;</strong>&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x5EA6;&#x63D0;&#x51FA;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x62E5;&#x5835;&#x7684;&#x6280;&#x672F;&#x65B9;&#x6848;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E4B;&#x524D;&#x7684;&#x5171;&#x8BC6;&#x662F;<strong>&#x6BD4;&#x7279;&#x5E01;&#x9700;&#x8981;&#x88AB;&#x62EF;&#x6551;</strong>&#xFF0C;&#x4E0D;&#x540C;&#x70B9;&#x4E3B;&#x8981;&#x5728;&#x4E8E;&#x5BF9;<strong>&#x533A;&#x5757;&#x5927;&#x5C0F;</strong>&#x7684;&#x4E89;&#x8BBA;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x771F;&#x5B9E;&#x7684;&#x4E89;&#x8BBA;&#x8FDC;&#x6BD4;&#x6211;&#x63CF;&#x8FF0;&#x7684;&#x8981;&#x590D;&#x6742;&#x4E0E;&#x6FC0;&#x70C8;&#x3002;&#x4E24;&#x65B9;&#x751A;&#x81F3;&#x591A;&#x65B9;&#x5BF9;&#x4E8E;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x62E5;&#x5835;&#x95EE;&#x9898;&#x4E0A;&#x63D0;&#x51FA;&#x8FC7;&#x5F88;&#x591A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6700;&#x7EC8;&#x624D;&#x5316;&#x4E3A;&#x4E24;&#x5927;&#x6D3E;&#x3002;&#x73B0;&#x5728;&#x628A;&#x63A7;&#x8A00;&#x8BBA;&#x66F4;&#x591A;&#x7684;&#x662F;BCH&#x7684;&#x652F;&#x6301;&#x65B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x652F;&#x6301;&#x65B9;&#x7684;&#x9886;&#x8896;&#x662F;&#x77FF;&#x4E3B;&#x7FA4;&#x4F53;&#xFF0C;&#x628A;Core&#x56E2;&#x961F;&#x63CF;&#x8FF0;&#x6210;&#x4FDD;&#x5B88;&#x515A;&#xFF0C;&#x628A;&#x63A7;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x800C;&#x4E0D;&#x613F;&#x610F;&#x542C;&#x4ECE;&#x4EBA;&#x6C11;&#x7684;&#x58F0;&#x97F3;&#x3002;&#x800C;Core&#x56E2;&#x961F;&#x7684;&#x652F;&#x6301;&#x8005;&#x628A;&#x77FF;&#x4E3B;&#x4EEC;&#x63CF;&#x8FF0;&#x6210;&#x77FF;&#x9738;&#xFF0C;&#x628A;&#x63A7;&#x7740;&#x6316;&#x77FF;&#x6743;&#x8FDB;&#x800C;&#x64CD;&#x7EB5;&#x6C11;&#x610F;&#x3002;&#x6709;&#x8FC7;&#x591A;&#x6B21;&#x4E0D;&#x6210;&#x529F;&#x7684;&#x63E1;&#x624B;&#x8A00;&#x548C;&#xFF0C;&#x4E89;&#x8BBA;&#x4E00;&#x76F4;&#x5728;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x4ECE;&#x60C5;&#x611F;&#x4E0A;&#x5224;&#x65AD;&#xFF0C;&#x6211;&#x66F4;&#x613F;&#x610F;&#x76F8;&#x4FE1;Core&#x56E2;&#x961F;&#x7684;&#x8282;&#x64CD;&#xFF0C;&#x800C;&#x4E0D;&#x592A;&#x76F8;&#x4FE1;&#x77FF;&#x4E3B;&#x4EEC;&#x7684;&#x8A00;&#x8BBA;&#x3002;&#x4F46;&#x662F;&#x4F5C;&#x4E3A;&#x6280;&#x672F;&#x4F20;&#x64AD;&#x8005;&#xFF0C;&#x6211;&#x4E0D;&#x592A;&#x60F3;&#x7528;&#x81EA;&#x5DF1;&#x5148;&#x5165;&#x4E3A;&#x4E3B;&#x89C2;&#x5FF5;&#x5F71;&#x54CD;&#x8BFB;&#x8005;&#x7684;&#x5224;&#x65AD;&#xFF0C;&#x4EC1;&#x8005;&#x89C1;&#x4EC1;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E9B;&#x4E89;&#x8BBA;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x672A;&#x6765;&#x8FD8;&#x6709;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x8DEF;&#x9700;&#x8981;&#x8D70;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="btc-3.html" class="navigation navigation-prev " aria-label="Previous page: 上帝给我十个比特币去交易">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="btc-5.html" class="navigation navigation-next " aria-label="Next page: 时代的召唤 —— 区块链 1.0 VS 2.0">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"比特币分叉——是技术的纠纷还是利益的冲突？","level":"1.2.4","depth":2,"next":{"title":"时代的召唤 —— 区块链 1.0 VS 2.0","level":"1.2.5","depth":2,"path":"btc/btc-5.md","ref":"btc/btc-5.md","articles":[]},"previous":{"title":"上帝给我十个比特币去交易","level":"1.2.3","depth":2,"path":"btc/btc-3.md","ref":"btc/btc-3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"btc/btc-4.md","mtime":"2018-04-08T07:58:44.968Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-19T18:14:53.738Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

