
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>你好，比特币 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="btc-2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    比特币篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="btc-1.html">
            
                <a href="btc-1.html">
            
                    
                    你好，比特币
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="btc-2.html">
            
                <a href="btc-2.html">
            
                    
                    越努力，越幸运 —— 比特币挖矿奥义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="btc-3.html">
            
                <a href="btc-3.html">
            
                    
                    上帝给我十个比特币去交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="btc-4.html">
            
                <a href="btc-4.html">
            
                    
                    比特币分叉——是技术的纠纷还是利益的冲突？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="btc-5.html">
            
                <a href="btc-5.html">
            
                    
                    时代的召唤 —— 区块链 1.0 VS 2.0
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../eth/">
            
                <a href="../eth/">
            
                    
                    以太坊篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../eth/eth-1.html">
            
                <a href="../eth/eth-1.html">
            
                    
                    别说你不知道以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../eth/eth-2.html">
            
                <a href="../eth/eth-2.html">
            
                    
                    PoW和PoS不得不说的小秘密
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >你好，比特币</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><img src="http://blockchain8.tech/usr/uploads/2018/03/421630250.jpg" alt="bitcoin.jpg"></p>
<h1 id="&#x6BD4;&#x7279;&#x5E01;&#x6982;&#x8FF0;">&#x6BD4;&#x7279;&#x5E01;&#x6982;&#x8FF0;</h1>
<p>&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x7B2C;&#x4E00;&#x4E2A;&#x843D;&#x5730;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x7531;&#x4E2D;&#x672C;&#x806A;&#x4E8E;2009&#x5E74;&#x5728;<a href="https://www.bitcoin.com/bitcoin.pdf" target="_blank">&#x300A;Bitcoin: A Peer-to-Peer Electronic Cash System&#x300B;</a>&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#x63D0;&#x51FA;&#x3002;&#x672C;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x5C06;&#x56F4;&#x7ED5;&#x8BE5;&#x8BBA;&#x6587;&#xFF0C;&#x4EE5;&#x4E00;&#x79CD;&#x901A;&#x4FD7;&#x4F46;&#x53C8;&#x4E0D;&#x5931;&#x4E25;&#x8C28;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8BB2;&#x8FF0;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x672F;&#x3002;</p>
<h2 id="&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;">&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;</h2>
<p>&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x90FD;&#x5B58;&#x5728;&#x201C;&#x4E2D;&#x5FC3;&#x201D;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E2D;&#x56FD;&#x4EBA;&#x6C11;&#x94F6;&#x884C;&#x4F5C;&#x4E3A;&#x201C;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x4E2D;&#x5FC3;&#x201D;&#xFF0C;&#x53D1;&#x884C;&#x4EBA;&#x6C11;&#x5E01;&#x4F9B;&#x5927;&#x5BB6;&#x4F7F;&#x7528;&#xFF1B;&#x652F;&#x4ED8;&#x5B9D;&#x4F5C;&#x4E3A;&#x201C;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x201D;&#xFF0C;&#x63D0;&#x4F9B;&#x7ED9;&#x4E70;&#x5BB6;&#x5356;&#x5BB6;&#x4E00;&#x624B;&#x4EA4;&#x94B1;&#x4E00;&#x624B;&#x4EA4;&#x8D27;&#x7684;&#x670D;&#x52A1;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x7684;&#x201D;&#x4E2D;&#x5FC3;&#x201C;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6781;&#x5177;&#x4FE1;&#x8A89;&#x7684;&#x7EC4;&#x7EC7;&#x6765;&#x7BA1;&#x63A7;&#x8D27;&#x5E01;&#x4E0E;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#x7EF4;&#x62A4;&#x8FD9;&#x6837;&#x7684;&#x4E2D;&#x5FC3;&#x6BD5;&#x7ADF;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4EE3;&#x4EF7;&#x3002;&#x6DD8;&#x5B9D;&#x5728;&#x5F88;&#x4E45;&#x524D;&#x5C31;&#x5DF2;&#x51FA;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD1;&#x4E9B;&#x5E74;&#x624D;&#x7531;&#x5E74;&#x8F7B;&#x4EBA;&#x5165;&#x624B;&#x6E10;&#x6E10;&#x5728;&#x5927;&#x4F17;&#x666E;&#x53CA;&#x5F00;&#x6765;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x7F3A;&#x4E4F;&#x7C7B;&#x4F3C;&#x4E8E;&#x652F;&#x4ED8;&#x5B9D;&#x8FD9;&#x6837;&#x7684;&#x201D;&#x4EA4;&#x6613;&#x4E2D;&#x5FC3;&#x201C;&#xFF0C;&#x5728;&#x4E00;&#x573A;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x4FDD;&#x8BC1;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x91D1;&#x94B1;&#x4E0E;&#x8D27;&#x7269;&#x80FD;&#x591F;&#x5B89;&#x5168;&#x65E0;&#x635F;&#x5730;&#x5F7C;&#x6B64;&#x4EA4;&#x6362;&#x3002;&#x652F;&#x4ED8;&#x5B9D;&#x540C;&#x6837;&#x82B1;&#x8D39;&#x4E86;&#x591A;&#x5E74;&#x624D;&#x53D6;&#x5F97;&#x4E86;&#x8F83;&#x4E3A;&#x666E;&#x904D;&#x7684;&#x4FE1;&#x4EFB;&#xFF0C;&#x884C;&#x4F7F;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x804C;&#x8D23;&#x3002;</p>
<p>&#x5728;&#x4F7F;&#x7528;&#x652F;&#x4ED8;&#x5B9D;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x540D;&#x8D26;&#x6237;&#xFF0C;&#x652F;&#x4ED8;&#x5B9D;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x8D26;&#x672C;&#xFF0C;&#x8BB0;&#x5F55;&#x4E86;&#x6211;&#x4EEC;&#x8D26;&#x6237;&#x4E0A;&#x7684;&#x4F59;&#x989D;&#x548C;&#x4EA4;&#x6613;&#x3002;&#x5F53;A&#x5411;B&#x8F6C;&#x8D26;100&#x5143;&#x65F6;&#xFF0C;&#x652F;&#x4ED8;&#x5B9D;&#x8BA9;A&#x7684;&#x4F59;&#x989D;&#x51CF;&#x53BB;100&#xFF0C;&#x540C;&#x65F6;&#x8BA9;B&#x7684;&#x4F59;&#x989D;&#x52A0;&#x4E0A;100&#x3002;&#x5BA2;&#x89C2;&#x4E0A;&#x8BB2;&#xFF0C;&#x652F;&#x4ED8;&#x5B9D;&#x80FD;&#x591F;&#x4EFB;&#x610F;&#x4FEE;&#x6539;&#x7528;&#x6237;&#x4F59;&#x989D;&#xFF0C;&#x64A4;&#x9500;&#x4EFB;&#x4E00;&#x4EA4;&#x6613;&#x3002;</p>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x4E0E;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x7684;&#x4E0D;&#x540C;">&#x6BD4;&#x7279;&#x5E01;&#x4E0E;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x7684;&#x4E0D;&#x540C;</h2>
<p>&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x5BF9;&#x4E8E;&#x5927;&#x5BB6;&#x800C;&#x8A00;&#x90FD;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x975E;&#x91D1;&#x878D;&#x9886;&#x57DF;&#x7684;&#x4EBA;&#x4E5F;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E0A;&#x8FF0;&#x63D0;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x7136;&#x800C;&#x5BF9;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5927;&#x5BB6;&#x9700;&#x8981;&#x7528;&#x4E00;&#x79CD;&#x5168;&#x65B0;&#x7684;&#x89C6;&#x89D2;&#x53BB;&#x7406;&#x89E3;&#xFF1A;</p>
<ol>
<li>&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x5B58;&#x5728;&#x201D;&#x4E2D;&#x5FC3;&#x201C;&#xFF0C;&#x6574;&#x4E2A;&#x4EA4;&#x6613;&#x4F53;&#x7CFB;&#x7684;&#x8FD0;&#x884C;&#x7531;&#x5168;&#x7403;&#x4F17;&#x591A;&#x81EA;&#x53D1;&#x7684;&#x8282;&#x70B9;&#x5171;&#x540C;&#x6765;&#x7EF4;&#x6301;&#xFF08;&#x201D;&#x81EA;&#x53D1;&#x201C;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x540E;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#xFF09;&#x3002;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#x7684;&#x201D;&#x4E2D;&#x5FC3;&#x201C;&#x5177;&#x6709;&#x6781;&#x5927;&#x7684;&#x6743;&#x5229;&#xFF0C;&#x5982;&#x540C;&#x5C01;&#x5EFA;&#x5E1D;&#x5236;&#xFF0C;&#x201D;&#x7687;&#x5E1D;&#x8282;&#x70B9;&#x201C;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x63A7;&#x5236;&#x5927;&#x578B;&#x4E2D;&#x5FC3;&#x8D26;&#x672C;&#x3002;&#x4F46;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x62E5;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x6C11;&#x4E3B;&#x6743;&#x3002;</li>
<li>&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x5B58;&#x5728;&#x5927;&#x578B;&#x4E2D;&#x5FC3;&#x8D26;&#x672C;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x6574;&#x4E2A;&#x8D26;&#x672C;&#x590D;&#x5236;&#x5728;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#x5927;&#x578B;&#x4E2D;&#x5FC3;&#x8D26;&#x672C;&#x7531;&#x201C;&#x4E2D;&#x5FC3;&#x201D;&#x63A7;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x5F80;&#x5F80;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EA;&#x5177;&#x5907;&#x7279;&#x5B9A;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x6BD4;&#x5982;A&#x53EA;&#x80FD;&#x67E5;&#x770B;&#x81EA;&#x5DF1;&#x7684;&#x8F6C;&#x8D26;&#x8BB0;&#x5F55;&#xFF0C;&#x4E0D;&#x80FD;&#x67E5;&#x770B;B&#x7684;&#x8F6C;&#x8D26;&#x8BB0;&#x5F55;&#x3002;&#x4F46;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x62E5;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x8D26;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x7684;&#x4F59;&#x989D;&#x4E0E;&#x8F6C;&#x8D26;&#x4FE1;&#x606F;&#x90FD;&#x662F;&#x5168;&#x7F51;&#x900F;&#x660E;&#x7684;&#x3002;</li>
<li>&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x5B58;&#x5728;&#x5B9E;&#x540D;&#x5236;&#x3002;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x201C;&#x4E2D;&#x5FC3;&#x201D;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x8981;&#x6C42;&#x6BCF;&#x4E2A;&#x4EBA;&#x5B9E;&#x540D;&#x5236;&#x5E76;&#x9650;&#x5236;&#x8D26;&#x6237;&#x6570;&#x91CF;&#x3002;&#x4F46;&#x662F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x521B;&#x5EFA;&#x65E0;&#x6570;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x8D26;&#x6237;&#xFF0C;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x5740;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;&#x7528;&#x6237;&#x540D;&#xFF09;&#x548C;&#x79C1;&#x94A5;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;&#x5BC6;&#x7801;&#xFF09;&#x3002;</li>
</ol>
<p>&#x4EE5;&#x4E0A;&#x4E09;&#x70B9;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x201C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x201D;&#xFF0C;&#x201C;&#x5206;&#x5E03;&#x5F0F;&#x8D26;&#x672C;&#x201D;&#xFF0C;&#x201C;&#x533F;&#x540D;&#x201D;&#x8FD9;&#x4E09;&#x4E2A;&#x7ECF;&#x5E38;&#x88AB;&#x4EBA;&#x63D0;&#x53CA;&#x7684;&#x7279;&#x70B9;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/1456300519.png" alt="bitcoin.png"></p>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x4E0E;&#x533A;&#x5757;&#x94FE;">&#x6BD4;&#x7279;&#x5E01;&#x4E0E;&#x533A;&#x5757;&#x94FE;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x4E0E;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x4E0D;&#x540C;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x4F9D;&#x9760;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x8FD9;&#x4E00;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x6280;&#x672F;&#x3002;&#x533A;&#x5757;&#x94FE;&#x5373;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8D26;&#x672C;&#xFF0C;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#x4E86;&#x8D26;&#x6237;&#x7684;&#x4F59;&#x989D;&#x3001;&#x8F6C;&#x8D26;&#x8BB0;&#x5F55;&#x7B49;&#x3002;</p>
<p>&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x7B80;&#x5355;&#x7406;&#x89E3;&#x5373;&#x662F;&#x4E00;&#x4E2A;&#x4E2A;&#x533A;&#x5757;&#x7EC4;&#x6210;&#x7684;&#x4E00;&#x6761;&#x94FE;&#xFF0C;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x5C31;&#x50CF;&#x662F;&#x505A;&#x7CD6;&#x846B;&#x82A6;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x5C71;&#x6942;&#x88AB;&#x4F9D;&#x6B21;&#x63D2;&#x5230;&#x7B7E;&#x5B50;&#x4E0A;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x6839;&#x76F8;&#x5F53;&#x957F;&#x7684;&#x7B7E;&#x5B50;&#x3002;</p>
<h1 id="&#x540E;&#x7EED;&#x6587;&#x7AE0;">&#x540E;&#x7EED;&#x6587;&#x7AE0;</h1>
<p>&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#xFF0C;&#x4E3B;&#x8981;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x548C;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4F53;&#x7CFB;&#x8FDB;&#x884C;&#x4E86;&#x5BF9;&#x6BD4;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x6587;&#x7AE0;&#x91CC;&#xFF0C;&#x5C06;&#x4F1A;&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x9010;&#x6B65;&#x8BB2;&#x8FF0;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 比特币篇">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="btc-2.html" class="navigation navigation-next " aria-label="Next page: 越努力，越幸运 —— 比特币挖矿奥义">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"你好，比特币","level":"1.2.1","depth":2,"next":{"title":"越努力，越幸运 —— 比特币挖矿奥义","level":"1.2.2","depth":2,"path":"btc/btc-2.md","ref":"btc/btc-2.md","articles":[]},"previous":{"title":"比特币篇","level":"1.2","depth":1,"path":"btc/README.md","ref":"btc/README.md","articles":[{"title":"你好，比特币","level":"1.2.1","depth":2,"path":"btc/btc-1.md","ref":"btc/btc-1.md","articles":[]},{"title":"越努力，越幸运 —— 比特币挖矿奥义","level":"1.2.2","depth":2,"path":"btc/btc-2.md","ref":"btc/btc-2.md","articles":[]},{"title":"上帝给我十个比特币去交易","level":"1.2.3","depth":2,"path":"btc/btc-3.md","ref":"btc/btc-3.md","articles":[]},{"title":"比特币分叉——是技术的纠纷还是利益的冲突？","level":"1.2.4","depth":2,"path":"btc/btc-4.md","ref":"btc/btc-4.md","articles":[]},{"title":"时代的召唤 —— 区块链 1.0 VS 2.0","level":"1.2.5","depth":2,"path":"btc/btc-5.md","ref":"btc/btc-5.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"btc/btc-1.md","mtime":"2018-04-08T07:58:44.967Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-19T18:14:53.738Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

