
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>时代的召唤 —— 区块链 1.0 VS 2.0 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../eth/" />
    
    
    <link rel="prev" href="btc-4.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    比特币篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="btc-1.html">
            
                <a href="btc-1.html">
            
                    
                    你好，比特币
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="btc-2.html">
            
                <a href="btc-2.html">
            
                    
                    越努力，越幸运 —— 比特币挖矿奥义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="btc-3.html">
            
                <a href="btc-3.html">
            
                    
                    上帝给我十个比特币去交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="btc-4.html">
            
                <a href="btc-4.html">
            
                    
                    比特币分叉——是技术的纠纷还是利益的冲突？
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.5" data-path="btc-5.html">
            
                <a href="btc-5.html">
            
                    
                    时代的召唤 —— 区块链 1.0 VS 2.0
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../eth/">
            
                <a href="../eth/">
            
                    
                    以太坊篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../eth/eth-1.html">
            
                <a href="../eth/eth-1.html">
            
                    
                    别说你不知道以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../eth/eth-2.html">
            
                <a href="../eth/eth-2.html">
            
                    
                    PoW和PoS不得不说的小秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../eth/eth-3.html">
            
                <a href="../eth/eth-3.html">
            
                    
                    如果你也想在以太坊上写点什么
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >时代的召唤 —— 区块链 1.0 VS 2.0</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><img src="http://blockchain8.tech/usr/uploads/2018/04/2296810449.jpg" alt="business-3194671_1280.jpg"></p>
<h1 id="&#x533A;&#x5757;&#x94FE;10">&#x533A;&#x5757;&#x94FE;1.0</h1>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5173;&#x7CFB;">&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5173;&#x7CFB;</h2>
<p>&#x5728;&#x6700;&#x521D;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5173;&#x7CFB;&#x63CF;&#x8FF0;&#x4E3A;<strong>&#x533A;&#x5757;&#x94FE;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8D26;&#x672C;</strong>&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#xFF08;bitcoin&#xFF09;&#x8FD9;&#x4E2A;&#x540D;&#x8BCD;&#x5728;&#x4E2D;&#x672C;&#x806A;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x533A;&#x5757;&#x94FE;&#xFF08;block chain&#xFF09;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x7684;&#x8BDE;&#x751F;&#x3002;&#x540E;&#x4EBA;&#x6839;&#x636E;&#x4E2D;&#x672C;&#x806A;&#x5728;&#x8BBA;&#x6587;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x7531;&#x533A;&#x5757;&#xFF08;block&#xFF09;&#x7EC4;&#x6210;&#x7684;&#x94FE;&#x5F0F;&#x7ED3;&#x6784;&#xFF0C;&#x624D;&#x63D0;&#x51FA;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x3002;&#x6240;&#x4EE5;&#xFF0C;<strong>&#x533A;&#x5757;&#x94FE;&#x662F;&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x6316;&#x6398;&#x51FA;&#x6765;&#x7684;&#x6280;&#x672F;</strong>&#x3002;</p>
<h2 id="&#x533A;&#x5757;&#x94FE;&#x53EA;&#x662F;&#x533A;&#x5757;&#x7684;&#x94FE;&#x5417;">&#x533A;&#x5757;&#x94FE;&#x53EA;&#x662F;&#x201C;&#x533A;&#x5757;&#x7684;&#x94FE;&#x201D;&#x5417;</h2>
<p>&#x4ECE;&#x5B57;&#x9762;&#x4E0A;&#x7406;&#x89E3;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x53EA;&#x662F;&#x7531;&#x533A;&#x5757;&#x7EC4;&#x6210;&#x7684;&#x94FE;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7406;&#x89E3;&#x5176;&#x5B9E;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x9519;&#x8BEF;&#x3002;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x8C08;&#x5230;&#x533A;&#x5757;&#x94FE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x5C06;&#x5171;&#x8BC6;&#x673A;&#x5236;&#xFF08;&#x5982;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;PoW&#xFF09;&#x7B49;&#x90FD;&#x5305;&#x542B;&#x5728;&#x5185;&#xFF0C;&#x6BD5;&#x7ADF;&#x5982;&#x679C;&#x533A;&#x5757;&#x94FE;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x533A;&#x5757;&#x7EC4;&#x6210;&#x7684;&#x94FE;&#x5F0F;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x8131;&#x79BB;&#x4E86;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x4E0B;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4FE1;&#x4EFB;&#xFF0C;&#x4E5F;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x5E73;&#x51E1;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x8C08;&#x5230;&#x533A;&#x5757;&#x94FE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B9E;&#x9645;&#x8C08;&#x7684;&#x662F;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x67B6;&#x6784;&#x4E0B;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<h2 id="&#x533A;&#x5757;&#x94FE;10&#x7684;&#x6784;&#x6210;">&#x533A;&#x5757;&#x94FE;1.0&#x7684;&#x6784;&#x6210;</h2>
<p>&#x8FD9;&#x5E45;&#x533A;&#x5757;&#x94FE;1.0&#x6280;&#x672F;&#x67B6;&#x6784;&#x56FE;&#x6765;&#x6E90;&#x4E8E;&#x300A;&#x4E2D;&#x56FD;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x548C;&#x5E94;&#x7528;&#x53D1;&#x5C55;&#x767D;&#x76AE;&#x4E66;&#xFF08;2016&#xFF09;&#x300B;&#xFF1A;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/3481625175.jpg" alt="78F0F3B4A3C1FCF9DB67EBC4B32DC377.jpg"></p>
<p>&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x8BA4;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6280;&#x672F;&#x67B6;&#x6784;&#x5373;&#x4E3A;&#x533A;&#x5757;&#x94FE;1.0&#x6280;&#x672F;&#x67B6;&#x6784;&#xFF0C;&#x5728;&#x5148;&#x524D;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6316;&#x77FF;&#x3001;&#x4EA4;&#x6613;&#x548C;&#x5206;&#x53C9;&#x4E09;&#x4E2A;&#x7EF4;&#x5EA6;&#x4E0A;&#x5206;&#x6790;&#x4E86;&#x533A;&#x5757;&#x94FE;1.0&#x6280;&#x672F;&#x67B6;&#x6784;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x6280;&#x672F;&#x3002;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x6982;&#x5FF5;&#xFF1A;</p>
<ol>
<li><strong>&#x77FF;&#x5DE5;</strong>&#xFF1A;&#x533A;&#x5757;&#x94FE;&#x5206;&#x5E03;&#x5F0F;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x53BB;&#x6316;&#x77FF;&#x3002;</li>
<li><strong>&#x6316;&#x77FF;</strong>&#xFF1A;&#x77FF;&#x5DE5;&#x4EEC;&#x62A2;&#x593A;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x5F53;&#x524D;&#x533A;&#x5757;&#x7684;&#x8BB0;&#x5F55;&#x6743;&#x3002;</li>
<li><strong>&#x5171;&#x8BC6;&#x673A;&#x5236;</strong>&#xFF1A;&#x8BA9;&#x5229;&#x76CA;&#x51B2;&#x7A81;&#x7684;&#x77FF;&#x5DE5;&#x4EEC;&#x5BF9;&#x8C01;&#x6316;&#x5230;&#x77FF;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5982;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF08;PoW&#xFF09;&#x7B97;&#x6CD5;&#x3002;</li>
<li><strong>&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;</strong>&#xFF1A;&#x4FDD;&#x8BC1;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x66F4;&#x5F3A;&#x7684;&#x77FF;&#x5DE5;&#x6709;&#x66F4;&#x5927;&#x6982;&#x7387;&#x53EF;&#x4EE5;&#x6316;&#x5230;&#x77FF;&#x3002;</li>
<li><strong>&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;</strong>&#xFF1A;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x94A5;&#x5319;&#xFF08;&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;&#xFF09;&#x7684;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x3002;</li>
<li><strong>&#x6570;&#x5B57;&#x7B7E;&#x540D;</strong>&#xFF1A;&#x8D26;&#x6237;&#x4F7F;&#x7528;&#x79C1;&#x94A5;&#x5BF9;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</li>
<li><strong>UTXO</strong>&#xFF1A;&#x4E00;&#x79CD;&#x533A;&#x522B;&#x4E8E;&#x4F20;&#x7EDF;&#x8D26;&#x672C;&#x8BB0;&#x8D26;&#x7684;&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;&#x3002;</li>
<li><strong>&#x5206;&#x53C9;</strong>&#xFF1A;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x4ECE;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x5F00;&#x59CB;&#x94FE;&#x53D8;&#x4E3A;&#x4E24;&#x6761;&#x6216;&#x8005;&#x591A;&#x6761;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5B66;&#x8FC7;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x8FD9;&#x662F;&#x533A;&#x5757;&#x94FE;&#x53D8;&#x6210;&#x4E86;&#x533A;&#x5757;&#x6811;&#x3002;</li>
</ol>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x8FD8;&#x5145;&#x6EE1;&#x8FF7;&#x832B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x9605;&#x8BFB;&#x5BF9;&#x5E94;&#x7684;&#x6587;&#x7AE0;&#x3002;</p>
<h2 id="&#x533A;&#x5757;&#x94FE;10">&#x533A;&#x5757;&#x94FE;1.0+</h2>
<p>&#x5728;&#x4E4B;&#x524D;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#xFF0C;&#x533A;&#x5757;&#x94FE;1.0&#x4E3B;&#x8981;&#x4E3A;&#x7528;&#x6237;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;<strong>&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x8D27;&#x5E01;&#x7CFB;&#x7EDF;</strong>&#xFF08;&#x5305;&#x542B;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x548C;&#x8D27;&#x5E01;&#x4EA4;&#x6613;&#xFF09;&#x548C;<strong>&#x4E00;&#x4E2A;&#x516C;&#x5F00;&#x900F;&#x660E;&#x53EF;&#x9760;&#x7684;&#x8D26;&#x672C;</strong>&#xFF08;&#x8BB0;&#x5F55;&#x8FD0;&#x884C;&#x5386;&#x53F2;&#xFF09;&#xFF0C;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#x3002;&#x5728;&#x73B0;&#x5B9E;&#x7684;&#x91D1;&#x878D;&#x4F53;&#x7CFB;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F8B;&#x5982;<strong>&#x4F17;&#x7B79;</strong>&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F17;&#x7B79;&#x5E73;&#x53F0;&#xFF0C;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x5982;&#x679C;&#x94B1;&#x6CA1;&#x6709;&#x7B79;&#x591F;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x5C06;&#x4F17;&#x7B79;&#x6765;&#x7684;&#x94B1;&#x9000;&#x8FD8;&#x7ED9;&#x5927;&#x5BB6;&#xFF1B;&#x5982;&#x679C;&#x94B1;&#x7B79;&#x591F;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x94B1;&#x7ED9;&#x53D1;&#x8D77;&#x4F17;&#x7B79;&#x7684;&#x673A;&#x6784;&#x6216;&#x4E2A;&#x4EBA;&#x3002;&#x4F46;&#x662F;&#x4F17;&#x7B79;&#x5E73;&#x53F0;&#x672C;&#x8D28;&#x4E0A;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x5316;&#x7CFB;&#x7EDF;&#xFF0C;&#x5BF9;&#x8D44;&#x4EA7;&#x6709;&#x7EDD;&#x5BF9;&#x7684;&#x628A;&#x63A7;&#x6743;&#xFF0C;&#x4F3C;&#x4E4E;&#x4E5F;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x4F53;&#x7CFB;&#x5E94;&#x8BE5;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x5417;&#xFF1F;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1F;&#x8BF7;&#x5927;&#x5BB6;&#x8DDF;&#x7740;&#x6211;&#x8FD9;&#x4F4D;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x601D;&#x8DEF;&#x53BB;&#x601D;&#x8003;&#xFF1A;&#x7A0B;&#x5E8F;&#x5458;&#x548C;&#x666E;&#x901A;&#x7528;&#x6237;&#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x662F;&#x666E;&#x901A;&#x7528;&#x6237;&#x5728;&#x4F7F;&#x7528;&#x8F6F;&#x4EF6;&#xFF0C;&#x800C;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x3002;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5199;&#x7279;&#x5B9A;&#x7684;&#x6267;&#x884C;&#x903B;&#x8F91;&#xFF0C;&#x7136;&#x540E;&#x6784;&#x9020;&#x51FA;&#x8F6F;&#x4EF6;&#x4F9B;&#x7ED9;&#x7528;&#x6237;&#x53BB;&#x4F7F;&#x7528;&#x3002;&#x800C;&#x6BD4;&#x7279;&#x5E01;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x5728;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x7684;&#x6BD4;&#x7279;&#x5E01;UTXO&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;&#x6211;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x8F93;&#x5165;&#x4E3A;&#x591A;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x8F93;&#x51FA;&#x4E5F;&#x4E3A;&#x591A;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7B80;&#x5316;&#x7684;&#x63CF;&#x8FF0;&#x65B9;&#x5F0F;&#x3002;&#x771F;&#x5B9E;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#x4EA4;&#x6613;&#x662F;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x89E3;&#x9501;&#x811A;&#x672C;&#xFF0C;&#x53BB;&#x89E3;&#x9501;&#x4E0A;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x7684;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/2076218123.png" alt="tx2.png"></p>
<p>&#x5F53;&#x7136;&#x666E;&#x901A;&#x7528;&#x6237;&#x65E0;&#x9700;&#x5173;&#x5FC3;&#x8FD9;&#x4E9B;&#x811A;&#x672C;&#xFF0C;&#x4F1A;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#x5E2E;&#x4F60;&#x751F;&#x6210;&#x3002;&#x5728;&#x8FD9;&#x6211;&#x53EA;&#x662F;&#x60F3;&#x8BF4;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x4F53;&#x7CFB;&#x4E2D;&#x662F;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x8FD9;&#x4E9B;&#x811A;&#x672C;&#x7528;&#x4EE5;&#x5F00;&#x53D1;&#x51FA;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x7684;&#xFF0C;&#x5982;&#x4F17;&#x7B79;&#x3002;</p>
<h1 id="&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x4E0E;&#x533A;&#x5757;&#x94FE;20">&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x4E0E;&#x533A;&#x5757;&#x94FE;2.0</h1>
<h2 id="&#x667A;&#x80FD;&#x5408;&#x7EA6;">&#x667A;&#x80FD;&#x5408;&#x7EA6;</h2>
<p>&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x672C;&#x8D28;&#x4E0A;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x8BA9;&#x533A;&#x5757;&#x94FE;&#x62E5;&#x6709;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#xFF0C;&#x4E0D;&#x4F1A;&#x8BA9;&#x533A;&#x5757;&#x94FE;&#x5E94;&#x7528;&#x5728;&#x9762;&#x5BF9;&#x65B0;&#x9700;&#x6C42;&#x65F6;&#x4E00;&#x7B79;&#x83AB;&#x5C55;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x811A;&#x672C;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x811A;&#x672C;&#x672C;&#x8EAB;&#x63D0;&#x4F9B;&#x7684;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#x8F83;&#x5F31;&#xFF0C;&#x53EA;&#x80FD;&#x7B97;&#x662F;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x7684;&#x96CF;&#x5F62;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x53EB;&#x5B83;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x6015;&#x88AB;&#x6253;&#x4E5F;&#x53EF;&#x4EE5;&#x53EB;&#x5B83;zhizhang&#x5408;&#x7EA6;&#x3002;</p>
<h2 id="&#x533A;&#x5757;&#x94FE;20">&#x533A;&#x5757;&#x94FE;2.0</h2>
<p>&#x901A;&#x5E38;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x533A;&#x5757;&#x94FE;1.0 + &#x667A;&#x80FD;&#x5408;&#x7EA6;&#x79F0;&#x4E3A;&#x533A;&#x5757;&#x94FE;2.0&#x3002;&#x533A;&#x5757;&#x94FE;2.0&#x6280;&#x672F;&#x67B6;&#x6784;&#x8BA9;&#x533A;&#x5757;&#x94FE;&#x62E5;&#x6709;&#x4E86;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x7684;&#x62D3;&#x5C55;&#x80FD;&#x529B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x67D0;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x5F00;&#x53D1;&#x51FA;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#xFF08;ETH&#xFF09;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6210;&#x529F;&#x7684;&#x57FA;&#x4E8E;&#x533A;&#x5757;&#x94FE;2.0&#x6280;&#x672F;&#x67B6;&#x6784;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/04/1505040576.jpg" alt="CDA453D5B70474B7CF2AAFE29E99E500.jpg"></p>
<h1 id="&#x540E;&#x7EED;&#x6587;&#x7AE0;">&#x540E;&#x7EED;&#x6587;&#x7AE0;</h1>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5C06;&#x8FDB;&#x5165;&#x4EE5;&#x592A;&#x574A;&#x7BC7;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#xFF0C;&#x8BA9;&#x4F60;&#x770B;&#x5230;&#x57FA;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x66F4;&#x52A0;&#x591A;&#x6837;&#x5316;&#x7684;&#x5E94;&#x7528;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="btc-4.html" class="navigation navigation-prev " aria-label="Previous page: 比特币分叉——是技术的纠纷还是利益的冲突？">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../eth/" class="navigation navigation-next " aria-label="Next page: 以太坊篇">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"时代的召唤 —— 区块链 1.0 VS 2.0","level":"1.2.5","depth":2,"next":{"title":"以太坊篇","level":"1.3","depth":1,"path":"eth/README.md","ref":"eth/README.md","articles":[{"title":"别说你不知道以太坊","level":"1.3.1","depth":2,"path":"eth/eth-1.md","ref":"eth/eth-1.md","articles":[]},{"title":"PoW和PoS不得不说的小秘密","level":"1.3.2","depth":2,"path":"eth/eth-2.md","ref":"eth/eth-2.md","articles":[]},{"title":"如果你也想在以太坊上写点什么","level":"1.3.3","depth":2,"path":"eth/eth-3.md","ref":"eth/eth-3.md","articles":[]}]},"previous":{"title":"比特币分叉——是技术的纠纷还是利益的冲突？","level":"1.2.4","depth":2,"path":"btc/btc-4.md","ref":"btc/btc-4.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"btc/btc-5.md","mtime":"2018-04-08T11:18:09.485Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-26T12:57:46.296Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

