
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>上帝给我十个比特币去交易 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="btc-4.html" />
    
    
    <link rel="prev" href="btc-2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    比特币篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="btc-1.html">
            
                <a href="btc-1.html">
            
                    
                    你好，比特币
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="btc-2.html">
            
                <a href="btc-2.html">
            
                    
                    越努力，越幸运 —— 比特币挖矿奥义
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="btc-3.html">
            
                <a href="btc-3.html">
            
                    
                    上帝给我十个比特币去交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="btc-4.html">
            
                <a href="btc-4.html">
            
                    
                    比特币分叉——是技术的纠纷还是利益的冲突？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="btc-5.html">
            
                <a href="btc-5.html">
            
                    
                    时代的召唤 —— 区块链 1.0 VS 2.0
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../eth/">
            
                <a href="../eth/">
            
                    
                    以太坊篇
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../eth/eth-1.html">
            
                <a href="../eth/eth-1.html">
            
                    
                    别说你不知道以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../eth/eth-2.html">
            
                <a href="../eth/eth-2.html">
            
                    
                    PoW和PoS不得不说的小秘密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../eth/eth-3.html">
            
                <a href="../eth/eth-3.html">
            
                    
                    如果你也想在以太坊上写点什么
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >上帝给我十个比特币去交易</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><img src="http://blockchain8.tech/usr/uploads/2018/03/2366011408.jpg" alt="key.jpg"></p>
<h1 id="&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8D26;&#x6237;">&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8D26;&#x6237;</h1>
<h2 id="&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;">&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;</h2>
<p>&#x5728;&#x56FD;&#x4EA7;&#x7279;&#x5DE5;&#x7535;&#x89C6;&#x5267;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x542C;&#x5230;&#x5BC6;&#x7801;&#x672C;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x7279;&#x5DE5;&#x4E0A;&#x4E0B;&#x7EBF;&#x4E4B;&#x95F4;&#x7528;&#x7535;&#x62A5;&#x4F20;&#x8F93;&#x6D88;&#x606F;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x7528;&#x5BC6;&#x7801;&#x672C;&#x6765;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x4E0E;&#x89E3;&#x5BC6;&#xFF0C;&#x5982;&#x679C;&#x5BC6;&#x7801;&#x672C;&#x88AB;&#x76D7;&#xFF0C;&#x654C;&#x65B9;&#x4E0D;&#x4EC5;&#x80FD;&#x4F7F;&#x7528;&#x5BC6;&#x7801;&#x672C;&#x8FDB;&#x884C;&#x60C5;&#x62A5;&#x7834;&#x8BD1;&#xFF08;&#x89E3;&#x5BC6;&#xFF09;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x60C5;&#x62A5;&#x9020;&#x5047;&#xFF08;&#x52A0;&#x5BC6;&#xFF09;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x628A;&#x201C;&#x94A5;&#x5319;&#x201D;&#x7684;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#xFF0C;&#x53EB;&#x505A;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x4F1F;&#x5927;&#x7684;&#x6570;&#x5B66;&#x5BB6;&#x4F7F;&#x7528;&#x6570;&#x5B66;&#x624B;&#x6BB5;&#x521B;&#x9020;&#x51FA;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x5373;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x4F7F;&#x7528;&#x7684;&#x201C;&#x94A5;&#x5319;&#x201D;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x4E00;&#x628A;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#xFF0C;&#x53E6;&#x4E00;&#x628A;&#x7528;&#x6765;&#x89E3;&#x5BC6;&#x3002;&#x5728;&#x901A;&#x4FE1;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x628A;&#x516C;&#x94A5;&#x4EA4;&#x7ED9;&#x5BF9;&#x65B9;&#xFF0C;&#x79C1;&#x94A5;&#x81EA;&#x5DF1;&#x672C;&#x5730;&#x4FDD;&#x5B58;&#x597D;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x79C1;&#x94A5;&#x7528;&#x6765;&#x89E3;&#x5BC6;&#x5BF9;&#x65B9;&#x53D1;&#x6765;&#x7684;&#x6D88;&#x606F;&#x3002;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x867D;&#x7136;&#x907F;&#x514D;&#x4E86;&#x4FE1;&#x606F;&#x7834;&#x8BD1;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x89E3;&#x51B3;&#x4FE1;&#x606F;&#x9020;&#x5047;&#x7684;&#x95EE;&#x9898;&#xFF09;</p>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x6237;">&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x6237;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8D26;&#x6237;&#x662F;&#x901A;&#x8FC7;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x8FD9;&#x4E2A;&#x5E38;&#x89C1;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x7B80;&#x5355;&#x7406;&#x89E3;&#xFF0C;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x62E5;&#x6709;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#xFF0C;&#x79C1;&#x94A5;&#x662F;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x4E25;&#x683C;&#x4FDD;&#x5BC6;&#x7684;&#x201C;&#x5BC6;&#x7801;&#x201D;&#xFF0C;&#x800C;&#x516C;&#x94A5;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x53EF;&#x4EE5;&#x8BA9;&#x4ED6;&#x4EBA;&#x77E5;&#x9053;&#x7684;&#x201C;&#x7528;&#x6237;&#x540D;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x7531;&#x4E8E;&#x516C;&#x94A5;&#x672C;&#x8EAB;&#x957F;&#x5EA6;&#x8FC7;&#x957F;&#xFF0C;&#x4E0D;&#x9002;&#x5408;&#x5F53;&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x6237;&#x7684;&#x201C;&#x7528;&#x6237;&#x540D;&#x201D;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6839;&#x636E;&#x516C;&#x94A5;&#x91CD;&#x65B0;&#x521B;&#x9020;&#x4E86;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x4F5C;&#x4E3A;&#x201C;&#x7528;&#x6237;&#x540D;&#x201D;&#x3002;&#x79C1;&#x94A5;&#x3001;&#x516C;&#x94A5;&#x3001;&#x5730;&#x5740;&#x7684;&#x6570;&#x5B66;&#x63A8;&#x5BFC;&#x5173;&#x7CFB;&#x5982;&#x4E0B;&#xFF1A;</p>
<blockquote>
<p>&#x79C1;&#x94A5;-&gt;&#x516C;&#x94A5;-&gt;&#x5730;&#x5740;</p>
</blockquote>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x8D26;&#x6237;&#x53EA;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x5176;&#x79C1;&#x94A5;&#x5373;&#x53EF;&#x3002;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x63A5;&#x53D7;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x79C1;&#x94A5;&#x751F;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x544A;&#x8BC9;&#x4ED6;&#x4EBA;&#x3002;</p>
<p>&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x6709;&#x4EBA;&#x95EE;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8D26;&#x6237;&#x662F;&#x600E;&#x4E48;&#x6765;&#x7684;&#xFF1F;&#x5176;&#x5B9E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8D26;&#x6237;&#x662F;&#x968F;&#x673A;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x7531;&#x4E8E;&#x8D26;&#x6237;&#x7684;&#x79C1;&#x94A5;&#x662F;&#x53EF;&#x4EE5;&#x63A8;&#x5BFC;&#x51FA;&#x516C;&#x94A5;&#x548C;&#x5730;&#x5740;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x9700;&#x8981;&#x968F;&#x673A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E0D;&#x662F;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#xFF1F;&#x7136;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5C31;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x79C1;&#x94A5;&#x662F;&#x4E00;&#x4E2A;256&#x4F4D;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF0C;&#x6211;&#x7528;Python&#x8BA1;&#x7B97;&#x4E86;&#x4E00;&#x4E0B;&#xFF1A;</p>
<pre><code>In [1]: 2 ** 256
Out[1]: 115792089237316195423570985008687907853269984665640564039457584007913129639936L
</code></pre><p>&#x8FD9;&#x5927;&#x7EA6;&#x662F;10&#x7684;78&#x6B21;&#x65B9;&#x3002;&#x6211;&#x53C8;&#x4E0A;&#x77E5;&#x4E4E;&#x641C;&#x4E86;&#x4E00;&#x4E0B;&#x5730;&#x7403;&#x4E0A;&#x6C99;&#x5B50;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x77E5;&#x4E4E;&#x544A;&#x8BC9;&#x6211;&#x5927;&#x7EA6;&#x662F;10&#x7684;21&#x6B21;&#x65B9;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x4FDD;&#x8BC1;&#x79C1;&#x94A5;&#x7684;&#x4EA7;&#x751F;&#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x88AB;&#x7834;&#x89E3;&#x7684;&#x53EF;&#x80FD;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/2156285655.png" alt="wallet.png"></p>
<p>&#x4E0A;&#x56FE;&#x662F;&#x6211;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x5730;&#x5740;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6253;&#x8D4F;&#x6211;&#xFF0C;&#x53EF;&#x4EE5;&#x8F6C;&#x8D26;&#x6BD4;&#x7279;&#x5E01;&#x5230;3AEJTJXqNmZWX6KNw9rkVpSrVaW7KG5FkD&#xFF09;&#x3002;&#x5982;&#x679C;&#x8BFB;&#x8005;&#x80FD;&#x591F;&#x7834;&#x89E3;&#x5230;&#x6211;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x5176;&#x4ED6;&#x4EBA;&#x6253;&#x8D4F;&#x7ED9;&#x6211;&#x7684;&#x94B1;&#x8F6C;&#x8D70;&#xFF0C;&#x54C8;&#x54C8;&#xFF01;</p>
<h1 id="&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EA4;&#x6613;">&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EA4;&#x6613;</h1>
<h2 id="&#x4F20;&#x7EDF;&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;">&#x4F20;&#x7EDF;&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;</h2>
<p>&#x76EE;&#x524D;&#x94F6;&#x884C;&#x3001;&#x652F;&#x4ED8;&#x5B9D;&#x7B49;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x8D26;&#x6237;&#x7684;&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;&#xFF0C;&#x5927;&#x81F4;&#x8FD0;&#x884C;&#x65B9;&#x5F0F;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<ol>
<li>&#x6BCF;&#x4E2A;&#x4EBA;&#x5728;&#x4EA4;&#x6613;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x3002;</li>
<li>A&#x548C;B&#x53D1;&#x751F;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x540C;&#x65F6;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4EE4;A&#x7684;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x51CF;&#x53BB;x&#xFF0C;B&#x7684;&#x4F59;&#x989D;&#x52A0;&#x4E0A;x&#x3002;&#x5982;&#x679C;A&#x7684;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x5C0F;&#x4E8E;x&#xFF0C;&#x5FC5;&#x7136;&#x4E0D;&#x5141;&#x8BB8;&#x53D1;&#x751F;&#x4EA4;&#x6613;&#x3002;</li>
<li>&#x5728;&#x8FC7;&#x7A0B;2&#x4E2D;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x5373;&#x4FDD;&#x8BC1;&#x6536;&#x652F;&#x5E73;&#x8861;&#xFF0C;&#x4E0D;&#x80FD;&#x51FA;&#x73B0;A&#x8D26;&#x6237;&#x51CF;&#x53BB;x&#xFF0C;&#x4F46;&#x662F;B&#x8D26;&#x6237;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF1B;&#x4E5F;&#x4E0D;&#x80FD;A&#x548C;B&#x4F59;&#x989D;&#x7684;&#x6539;&#x53D8;&#x91CF;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</li>
</ol>
<p>&#x5728;&#x8FD9;&#x6837;&#x7684;&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x6765;&#x4E34;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x8D26;&#x6237;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4EA4;&#x6613;&#x53CC;&#x65B9;&#x7684;&#x4F59;&#x989D;&#x3002;</p>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;">&#x6BD4;&#x7279;&#x5E01;&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;</h2>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EA4;&#x6613;&#x94FE;&#x8BA1;&#x7B97;&#x51FA;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x7684;&#x4F59;&#x989D;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x65B0;&#x9896;&#x7684;UTXO&#xFF08;Unspent Transaction Output&#xFF0C;&#x672A;&#x82B1;&#x8D39;&#x7684;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF09;&#x8BB0;&#x8D26;&#x65B9;&#x5F0F;&#x3002;&#x5176;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#xFF1A;A&#x7528;&#x6237;&#x53EA;&#x8981;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x4ED6;&#x62E5;&#x6709;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7ED9;B&#x7528;&#x6237;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x81F3;&#x4E8E;&#x4ED6;&#x7684;&#x4F59;&#x989D;&#x662F;&#x591A;&#x5C11;&#xFF0C;B&#x6839;&#x672C;&#x65E0;&#x9700;&#x5173;&#x5FC3;&#xFF0C;&#x7CFB;&#x7EDF;&#x81EA;&#x7136;&#x4E5F;&#x65E0;&#x9700;&#x989D;&#x5916;&#x8BB0;&#x5F55;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x5F53;&#x524D;&#x533A;&#x5757;&#x4EA7;&#x751F;&#x4E86;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x7531;&#x806A;&#x806A;&#x6316;&#x51FA;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#xFF08;TX&#xFF09;&#x2014;&#x2014;&#x4E0A;&#x5E1D;&#x7ED9;&#x4E86;&#x806A;&#x806A;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x65B9;&#xFF08;Output&#xFF09;&#x5373;&#x806A;&#x806A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x5C31;&#x662F;UTXO&#xFF08;&#x672A;&#x82B1;&#x8D39;&#x7684;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF09;&#x3002;&#x5F53;&#x806A;&#x806A;&#x60F3;&#x4EA4;&#x6613;&#x7ED9;&#x5C0F;&#x7530;5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x627E;&#x5230;&#x8FD9;&#x4E2A;UTXO&#xFF0C;&#x7136;&#x540E;&#x82B1;&#x8D39;&#x6389;&#x8FD9;&#x4E2A;UTXO&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;TX&#x4E0D;&#x518D;&#x662F;UTXO&#xFF0C;&#x4F46;&#x662F;&#x4EA7;&#x751F;&#x4E86;&#x4E24;&#x4E2A;&#x65B0;&#x7684;UTXO&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/2473837295.png" alt="utxo.png"></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5C3D;&#x7BA1;&#x806A;&#x806A;&#x7684;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x53EA;&#x82B1;&#x8D39;&#x4E86;5&#x4E2A;&#xFF0C;&#x4F46;&#x662F;&#x539F;&#x6765;&#x7684;UTXO&#x4E5F;&#x4E0D;&#x80FD;&#x518D;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;UTXO&#x72B6;&#x6001;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5982;&#x679C;&#x806A;&#x806A;&#x60F3;&#x518D;&#x7ED9;&#x5C0F;&#x6021;5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5C31;&#x4E0D;&#x80FD;&#x518D;&#x4F7F;&#x7528;&#x539F;&#x6765;&#x7684;TX&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x65B0;&#x7684;UTXO&#x2014;&#x2014;&#x806A;&#x806A;&#x7ED9;&#x4E86;&#x806A;&#x806A;5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x907F;&#x514D;&#x4E86;&#x591A;&#x91CD;&#x652F;&#x4ED8;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x806A;&#x806A;&#x4F7F;&#x7528;&#x591A;&#x6B21;&#x539F;&#x59CB;&#x7684;TX&#x2014;&#x2014;&#x4E0A;&#x5E1D;&#x7ED9;&#x4E86;&#x806A;&#x806A;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x5236;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x94F8;&#x5E01;&#x6240;&#xFF0C;&#x5F53;&#x8FDB;&#x884C;&#x4E00;&#x573A;&#x4EA4;&#x6613;&#x540E;&#xFF0C;&#x539F;&#x6765;&#x7684;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5728;&#x94F8;&#x5E01;&#x6240;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x8FDB;&#x800C;&#x88AB;&#x6253;&#x9020;&#x6210;&#x4E86;&#x4E24;&#x4E2A;&#x5168;&#x65B0;&#x7684;5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<h2 id="&#x4EA4;&#x6613;&#x52A0;&#x5BC6;&#x8BA4;&#x8BC1;">&#x4EA4;&#x6613;&#x52A0;&#x5BC6;&#x8BA4;&#x8BC1;</h2>
<p>&#x5728;&#x4E00;&#x573A;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x4EA4;&#x6613;&#x7684;&#x53D1;&#x8D77;&#x8005;&#x4E3B;&#x8981;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4EE5;&#x4E0B;&#x4FE1;&#x606F;&#xFF1A;</p>
<ol>
<li>&#x4E0A;&#x4E00;&#x7B14;UTXO&#x4EA4;&#x6613;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF08;&#x6307;&#x660E;&#x4F60;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;UTXO&#xFF09;&#x3002;</li>
<li>&#x4EA4;&#x6613;&#x53CC;&#x65B9;&#x7684;&#x5730;&#x5740;&#x3002;</li>
<li>&#x4F60;&#x7684;&#x516C;&#x94A5;&#x3002;</li>
<li>&#x4F60;&#x7528;&#x79C1;&#x94A5;&#x5BF9;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x7B7E;&#x540D;&#xFF08;&#x52A0;&#x5BC6;&#xFF09;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
</ol>
<p>&#x5F53;&#x77FF;&#x5DE5;&#x62FF;&#x5230;&#x4F60;&#x7684;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#xFF0C;&#x4F1A;&#x8FDB;&#x884C;&#x4EE5;&#x4E0B;&#x6821;&#x9A8C;&#xFF1A;</p>
<ol>
<li>&#x6BD4;&#x5BF9;&#x4F60;&#x7684;&#x5730;&#x5740;&#x548C;UTXO&#x4EA4;&#x6613;&#x54C8;&#x5E0C;&#x503C;&#x4E2D;&#x7684;&#x8F93;&#x51FA;&#x5730;&#x5740;&#xFF08;&#x786E;&#x8BA4;&#x8BE5;&#x5730;&#x5740;&#x62E5;&#x6709;&#x8BE5;UTXO&#xFF09;&#x3002;</li>
<li>&#x7528;&#x516C;&#x94A5;&#x8BA1;&#x7B97;&#x51FA;&#x5730;&#x5740;&#xFF0C;&#x6BD4;&#x5BF9;&#x8BE5;&#x5730;&#x5740;&#x548C;&#x4F60;&#x7684;&#x5730;&#x5740;&#xFF08;&#x786E;&#x8BA4;&#x516C;&#x94A5;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF09;&#x3002;</li>
<li>&#x7528;&#x516C;&#x94A5;&#x5BF9;&#x7B7E;&#x540D;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x89E3;&#x5BC6;&#xFF0C;&#x786E;&#x8BA4;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x4E0E;&#x89E3;&#x5BC6;&#x540E;&#x7684;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x4E00;&#x81F4;&#xFF08;&#x786E;&#x8BA4;&#x79C1;&#x94A5;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF09;&#x3002;</li>
</ol>
<p>&#x65E0;&#x8BBA;&#x4EE5;&#x4E0A;&#x54EA;&#x4E00;&#x6B65;&#x6821;&#x9A8C;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x4EA4;&#x6613;&#x90FD;&#x4F1A;&#x6821;&#x9A8C;&#x5931;&#x8D25;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x524D;&#x4E24;&#x6B65;&#x6821;&#x9A8C;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x670D;&#x52A1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x8D26;&#x6237;&#x79C1;&#x94A5;&#x662F;&#x7EDD;&#x5BF9;&#x4FDD;&#x5BC6;&#x7684;&#x3002;&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x5728;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x4E2D;&#x67E5;&#x8BE2;&#x5230;&#xFF1B;&#x800C;&#x516C;&#x94A5;&#x4F1A;&#x5728;&#x4F60;&#x53D1;&#x8D77;&#x7B2C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x540E;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x5C31;&#x66F4;&#x9700;&#x8981;&#x4F60;&#x4FDD;&#x7BA1;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x94A5;&#x3002;</p>
<h2 id="&#x4EA4;&#x6613;&#x7684;&#x5206;&#x5272;&#x4E0E;&#x7EC4;&#x5408;">&#x4EA4;&#x6613;&#x7684;&#x5206;&#x5272;&#x4E0E;&#x7EC4;&#x5408;</h2>
<p>&#x4E00;&#x679A;&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x50CF;&#x4E00;&#x679A;&#x786C;&#x5E01;&#x4E00;&#x6837;&#x4E0D;&#x53EF;&#x5207;&#x5272;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x662F;&#x806A;&#xFF0C;1&#x6BD4;&#x7279;&#x5E01;=1&#x4EBF;&#x806A;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x65E2;&#x7136;UTXO&#x4F5C;&#x4E3A;&#x62E5;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8BC1;&#x660E;&#xFF0C;&#x4E5F;&#x5FC5;&#x7136;&#x9700;&#x8981;&#x5206;&#x5272;&#x4E0E;&#x7EC4;&#x5408;&#x3002;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E3E;&#x7684;&#x4F8B;&#x5B50;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF1A;&#x8F93;&#x5165;&#x4E00;&#x4E2A;UTXO&#xFF0C;&#x8F93;&#x51FA;&#x4E24;&#x4E2A;UTXO&#x3002;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x662F;&#x5141;&#x8BB8;&#x591A;&#x8F93;&#x5165;&#x548C;&#x591A;&#x8F93;&#x51FA;&#x7684;&#x3002;</p>
<p><img src="http://blockchain8.tech/usr/uploads/2018/03/2076218123.png" alt="tx2.png"></p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4EA4;&#x6613;&#x53D1;&#x8D77;&#x8005;&#x90FD;&#x9700;&#x8981;&#x8BC1;&#x660E;&#x5176;&#x8D22;&#x5BCC;&#x5F52;&#x5C5E;&#x6743;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="btc-2.html" class="navigation navigation-prev " aria-label="Previous page: 越努力，越幸运 —— 比特币挖矿奥义">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="btc-4.html" class="navigation navigation-next " aria-label="Next page: 比特币分叉——是技术的纠纷还是利益的冲突？">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"上帝给我十个比特币去交易","level":"1.2.3","depth":2,"next":{"title":"比特币分叉——是技术的纠纷还是利益的冲突？","level":"1.2.4","depth":2,"path":"btc/btc-4.md","ref":"btc/btc-4.md","articles":[]},"previous":{"title":"越努力，越幸运 —— 比特币挖矿奥义","level":"1.2.2","depth":2,"path":"btc/btc-2.md","ref":"btc/btc-2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"btc/btc-3.md","mtime":"2018-04-08T07:58:44.968Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-26T12:57:46.296Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

